revk/ESP32RevK/revk.c
// Main control code, working with WiFi, MQTT, and managing settings and OTA Copyright ©2019 Adrian Kennard Andrews & Arnold Ltd

static const char __attribute__((unused)) * TAG = "RevK";

//#define       SETTING_DEBUG
//#define       SETTING_CHANGED

#define	ESP_IDF_431             // Older

// Note, low wifi buffers breaks mesh

#include "revk.h"
#include "settings_lib.h"

#ifdef	CONFIG_ENABLE_WIFI_STATION
#undef	CONFIG_REVK_APMODE      // Bodge - clashes
#endif
#ifndef	CONFIG_REVK_APMODE
#undef	CONFIG_REVK_APDNS       // Bodge
#endif
#ifdef	CONFIG_REVK_MATTER
#undef	CONFIG_MDNS_MAX_INTERFACES      // Bodge - clashes
#endif

#ifndef CONFIG_IDF_TARGET_ESP8266
#include "esp_mac.h"
#include "aes/esp_aes.h"
#endif
#include "esp_http_client.h"
#include "esp_ota_ops.h"
#include "esp_tls.h"
#ifdef	CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
#include "esp_crt_bundle.h"
#else
#include "lecert.h"
#endif
#include "esp_task_wdt.h"
#include "esp_sntp.h"
#include "esp_phy_init.h"
#include "esp_sleep.h"
#include <driver/gpio.h>
#ifdef	CONFIG_REVK_MESH
#include <esp_mesh.h>
#include "freertos/semphr.h"
#endif
#ifdef  CONFIG_MDNS_MAX_INTERFACES
#include "mdns.h"
#endif
#ifdef  CONFIG_NIMBLE_ENABLED
#include "esp_bt.h"
#endif
#if	defined(CONFIG_REVK_LUNAR) || defined(CONFIG_REVK_SOLAR)
#include <math.h>
#endif

#include "esp8266_rtc_io_compat.h"
#include "esp8266_ota_compat.h"
#include "esp8266_flash_compat.h"
#include "esp8266_gpio_compat.h"
#include "esp8266_wdt_compat.h"

const char revk_build_suffix[] = CONFIG_REVK_BUILD_SUFFIX;

// https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/protocols/esp_tls.html
//#ifndef       CONFIG_ESP_TLS_USING_WOLFSSL
//#warning You may want to use WolfSSL: git submodule add --recursive https://github.com/espressif/esp-wolfssl.git components/esp-wolfssl
//#endif

//#ifndef       CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS
//#warning CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS recommended
//#endif

//#ifndef       CONFIG_MBEDTLS_DYNAMIC_BUFFER
//#warning CONFIG_MBEDTLS_DYNAMIC_BUFFER recommended
//#endif

#ifdef	CONFIG_LWIP_IPV6
#ifndef CONFIG_LWIP_IPV6_AUTOCONFIG
#warning No CONFIG_LWIP_IPV6_AUTOCONFIG
#endif
#endif

#ifndef CONFIG_IDF_TARGET_ESP8266
#ifndef	CONFIG_LWIP_TCPIP_CORE_LOCKING
#warning	Suggest CONFIG_LWIP_TCPIP_CORE_LOCKING
#endif
#endif

#ifdef	CONFIG_MBEDTLS_DYNAMIC_BUFFER
#warning CONFIG_MBEDTLS_DYNAMIC_BUFFER is buggy, sadly
#endif

#if CONFIG_FREERTOS_HZ != 1000
#warning CONFIG_FREERTOS_HZ recommend set to 1000
#endif

#ifndef CONFIG_ESP_TASK_WDT_PANIC
#warning CONFIG_ESP_TASK_WDT_PANIC recommended
#endif

#ifdef  CONFIG_REVK_OLD_SETTINGS
#define	settings	\
		s(otahost,CONFIG_REVK_OTAHOST);		\
		u8(otadays,CONFIG_REVK_OTADAYS);	\
		b(otaauto,true);			\
		u16(otastart,600);			\
		b(otabeta,false);			\
		bd(otacert,CONFIG_REVK_OTACERT);	\
		s(ntphost,CONFIG_REVK_NTPHOST);		\
		s(tz,CONFIG_REVK_TZ);			\
		u32(watchdogtime,CONFIG_REVK_WATCHDOG);			\
		s(appname,CONFIG_REVK_APPNAME);		\
    		s(nodename,NULL);			\
		s(hostname,NULL);			\
		p(command);				\
		p(setting);				\
		p(state);				\
		p(event);				\
		p(info);				\
		p(error);				\
    		b(prefixapp,CONFIG_REVK_PREFIXAPP);	\
    		b(prefixhost,CONFIG_REVK_PREFIXHOST);	\
		led(blink,3,CONFIG_REVK_BLINK);				\
    		bdp(clientkey,NULL);			\
    		bd(clientcert,NULL);			\

#define	apconfigsettings	\
		u32(apport,CONFIG_REVK_APPORT);		\
		u32(aptime,CONFIG_REVK_APTIME);		\
		u32(apwait,CONFIG_REVK_APWAIT);		\
		io(apgpio,CONFIG_REVK_APGPIO);		\

#define	mqttsettings	\
		sa(mqtthost,CONFIG_REVK_MQTT_CLIENTS,CONFIG_REVK_MQTTHOST);	\
		sa(mqttuser,CONFIG_REVK_MQTT_CLIENTS,CONFIG_REVK_MQTTUSER);	\
		sap(mqttpass,CONFIG_REVK_MQTT_CLIENTS,CONFIG_REVK_MQTTPASS);	\
		u16a(mqttport,CONFIG_REVK_MQTT_CLIENTS,CONFIG_REVK_MQTTPORT);	\
		bad(mqttcert,CONFIG_REVK_MQTT_CLIENTS,CONFIG_REVK_MQTTCERT);	\

#define	wifisettings	\
		u16(wifireset,CONFIG_REVK_WIFIRESET);	\
		u16(wifiuptime,0);	\
		s(wifissid,CONFIG_REVK_WIFISSID);	\
		s(wifiip,CONFIG_REVK_WIFIIP);		\
		s(wifigw,CONFIG_REVK_WIFIGW);		\
		sa(wifidns,3,CONFIG_REVK_WIFIDNS);		\
		h(wifibssid,6,CONFIG_REVK_WIFIBSSID);	\
		u8(wifichan,CONFIG_REVK_WIFICHAN);	\
		sp(wifipass,CONFIG_REVK_WIFIPASS);	\
    		b(wifips,CONFIG_REVK_WIFIPS);		\
    		b(wifimaxps,CONFIG_REVK_WIFIMAXPS);	\

#define	apsettings	\
		s(apssid,CONFIG_REVK_APSSID);		\
		sp(appass,CONFIG_REVK_APPASS);		\
    		u8(apmax,CONFIG_REVK_APMAX);	\
		s(apip,CONFIG_REVK_APIP);		\
		b(aplr,CONFIG_REVK_APLR);		\
		b(aphide,CONFIG_REVK_APHIDE);		\

#define	meshsettings	\
		u16(meshreset,CONFIG_REVK_MESHRESET);	\
		h(meshid,6,CONFIG_REVK_MESHID);		\
		hs(meshkey,16,NULL);		\
    		u16(meshwidth,CONFIG_REVK_MESHWIDTH);	\
    		u16(meshdepth,CONFIG_REVK_MESHDEPTH);	\
    		u16(meshmax,CONFIG_REVK_MESHMAX);	\
		sp(meshpass,CONFIG_REVK_MESHPASS);	\
		b(meshlr,CONFIG_REVK_MESHLR);		\
    		b(meshroot,false);			\

#define s(n,d)		char *n;
#define sp(n,d)		char *n;
#define sa(n,a,d)	char *n[a];
#define sap(n,a,d)	char *n[a];
#define fh(n,a,s,d)	char n[a][s];
#define	u32(n,d)	uint32_t n;
#define	u16(n,d)	uint16_t n;
#define	u16a(n,a,d)	uint16_t n[a];
#define	i16(n)		int16_t n;
#define	u8a(n,a,d)	uint8_t n[a];
#define	u8(n,d)		uint8_t n;
#define	b(n,d)		uint8_t n;
#define	s8(n,d)		int8_t n;
#define	io(n,d)		revk_gpio_t n;
#define	ioa(n,a,d)	revk_gpio_t n[a];
#ifndef	CONFIG_REVK_BLINK
#define	led(n,a,d)	extern revk_gpio_t n[a];
#else
#define	led(n,a,d)	revk_gpio_t n[a];
#endif
#define p(n)		char *topic##n;
#define h(n,l,d)	char n[l];
#define hs(n,l,d)	uint8_t n[l];
#define bd(n,d)		revk_bindata_t *n;
#define bad(n,a,d)	revk_bindata_t *n[a];
#define bdp(n,d)	revk_bindata_t *n;
settings
#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
   wifisettings
#ifdef	CONFIG_REVK_MESH
   meshsettings
#else
   apsettings
#endif
#endif
#ifdef	CONFIG_REVK_MQTT
   mqttsettings
#endif
#ifdef	CONFIG_REVK_APMODE
   apconfigsettings
#endif
#undef s
#undef sp
#undef sa
#undef sap
#undef fh
#undef u32
#undef u16
#undef u16a
#undef i16
#undef u8
#undef b
#undef u8a
#undef s8
#undef io
#undef ioa
#undef led
#undef p
#undef h
#undef hs
#undef bd
#undef bad
#undef bdp
#endif
/* Public */
const char *revk_version = "";  /* Git version */
const char *revk_app = "";      /* App name */
char revk_id[13] = "";          /* Chip ID as hex (from MAC) */
uint64_t revk_binid = 0;        /* Binary chip ID */
mac_t revk_mac;                 // MAC

static int8_t ota_percent = -1;

static uint8_t gotip = 0;       // Avoid double reporting - bit 7 is IPv4, bits 0-6 are ipv6 index - bit 0 is normally link local

static int
ota_in_progress (void)
{
   return ota_percent > 0 && ota_percent <= 100;
}

#ifdef	CONFIG_REVK_LED_STRIP
led_strip_handle_t revk_strip = NULL;
#endif

/* Local */
static struct
{                               // Flags
   uint8_t die:1;               // Final die
   uint8_t gotipv6:1;           // Just got an IPv6
   uint8_t setting_dump_requested:2;
   uint8_t wdt_test:1;
   uint8_t disableupgrade:1;
   uint8_t disablewifi:1;
   uint8_t disableap:1;
   uint8_t disablesettings:1;
#ifdef	CONFIG_REVK_MESH
   uint8_t mesh_root_known:1;
#endif
   uint8_t factorywas:1;
   uint8_t factorycount:2;
   uint8_t factorytick:5;
} volatile b = { 0 };

static uint32_t up_next;        // next up report (uptime)
static EventGroupHandle_t revk_group;
const static int GROUP_OFFLINE = BIT0;  // We are off line (IP not set)
#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
const static int GROUP_WIFI = BIT1;     // We are WiFi connected
const static int GROUP_IP = BIT2;       // We have IP address
#endif
#ifdef	CONFIG_REVK_MQTT
const static int GROUP_MQTT = BIT6 /*7... */ ;  // We are MQTT connected - and MORE BITS (CONFIG_REVK_MQTT_CLIENTS)
const static int GROUP_MQTT_DOWN = (GROUP_MQTT << CONFIG_REVK_MQTT_CLIENTS);    /*... */
#endif
static TaskHandle_t ota_task_id = NULL;
static app_callback_t *app_callback = NULL;
lwmqtt_t mqtt_client[CONFIG_REVK_MQTT_CLIENTS] = { };

static uint32_t restart_time = 0;
uint32_t revk_nvs_time = 0;
static char *restart_reason = NULL;
#ifdef	CONFIG_REVK_OLD_SETTINGS
nvs_handle revk_nvs = -1;
#endif
#if    defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
static uint32_t link_down = 1;  // When link last down
esp_netif_t *sta_netif = NULL;
esp_netif_t *ap_netif = NULL;
#endif
static uint8_t blink_on = 0,
   blink_off = 0;
static const char *blink_colours = NULL;

