revk/ESP32RevK/revk.c
#ifdef	CONFIG_REVK_MQTT
char *
revk_topic (const char *name, const char *id, const char *suffix)
{                               // Construct a topic, malloc'd and return pointer to it
   if (!id)
      id = hostname;
   if (!*id)
      id = NULL;
   const char *t[4] = { 0 };
   uint8_t tn = 0;              // count
   if (prefixhost)
   {
      if (prefixapp)
         t[tn++] = appname;
      if (id)
         t[tn++] = id;
      if (name && (!prefixapp || name != appname))
         t[tn++] = name;
   } else
   {
      if (name)
         t[tn++] = name;
      if (prefixapp && name != appname)
         t[tn++] = appname;
      if (id)
         t[tn++] = id;
   }
   if (suffix)
      t[tn++] = suffix;
   char *topic = NULL;
   if (t[3])
      asprintf (&topic, "%s/%s/%s/%s", t[0], t[1], t[2], t[3]);
   else if (t[2])
      asprintf (&topic, "%s/%s/%s", t[0], t[1], t[2]);
   else if (t[1])
      asprintf (&topic, "%s/%s", t[0], t[1]);
   else
      asprintf (&topic, "%s", t[0]);
   return topic;
}
#endif

#ifdef	CONFIG_REVK_MQTT
void
revk_send_subunsub (int client, const mac_t mac, uint8_t sub)
{
   char id[13];
   sprintf (id, "%02X%02X%02X%02X%02X%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
   if (client >= CONFIG_REVK_MQTT_CLIENTS || !lwmqtt_connected (mqtt_client[client]))
      return;
   ESP_LOGI (TAG, "MQTT%d %s %s", client, sub ? "Subscribe" : "Unsubscribe", id);
   void subunsub (const char *prefix)
   {
      void send (const char *id)
      {
         char *topic = revk_topic (prefix, id, "#");
         if (!topic)
            return;
         if (sub)
            lwmqtt_subscribe (mqtt_client[client], topic);
         else
            lwmqtt_unsubscribe (mqtt_client[client], topic);
         freez (topic);
      }
      send (id);
      send (prefixapp ? "*" : appname); // All apps
      if (*hostname && strcmp (hostname, id))
         send (hostname);       // Hostname as well as MAC
#ifndef  CONFIG_REVK_OLD_SETTINGS
      if (prefix == topiccommand)
         for (int i = 0; i < sizeof (topicgroup) / sizeof (*topicgroup); i++)
            if (*topicgroup[i])
               send (topicgroup[i]);
#endif
   }
   subunsub (topiccommand);
   if (!client)
      subunsub (topicsetting);
}
#endif

#ifdef	CONFIG_REVK_MQTT
static void
mqtt_rx (void *arg, char *topic, unsigned short plen, unsigned char *payload)
{                               // Expects to be able to write over topic
   int client = (int) arg;
   if (client < 0 || client >= CONFIG_REVK_MQTT_CLIENTS)
      return;
   if (topic)
   {
      const char *err = NULL;
      // Break up topic
      char *prefix = NULL;      // What type of message, e.g. command, etc, at start or after id if prefixhost set
      char *target = NULL;      // The ID (hostname or MAC or *)
      char *suffix = NULL;      // The suffix, e.g. what command, etc, optional
      char *apppart = NULL;     // The app part (before prefix) if prefixapp set
      char *p = topic;
      void getprefix (void)
      {                         // Handle prefix (allow for / in command/setting)
         if (!*p)
            return;
         prefix = p;
         int l = 0;
         if (*topiccommand && !strncmp (p, topiccommand, l = strlen (topiccommand)) && (!p[l] || p[l] == '/'))
            p += l;
         else if (*topicsetting && !strncmp (p, topicsetting, l = strlen (topicsetting)) && (!p[l] || p[l] == '/'))
            p += l;
         else
            while (*p && *p != '/')
               p++;
         if (*p)
            p++;
      }
      void getapp (void)
      {                         // Get app, only if app expected and correct
         int l = strlen (appname);
         if (!prefixapp || strncmp (p, appname, l) || (p[l] && p[l] != '/'))
            return;             // Not a expected, or correct, app prefix
         apppart = p;
         while (*p && *p != '/')
            p++;
         if (*p)
            p++;
      }
      void gettarget (void)
      {
         if (!*p)
            return;
         target = p;
         while (*p && *p != '/')
            p++;
         if (*p)
            p++;
      }
      if (prefixhost)
      {                         // We expect (appname/)id first
         getapp ();
         gettarget ();
         getprefix ();
      } else
      {                         // We expect prefix (command/setting) first
         getprefix ();
         getapp ();
         gettarget ();
      }
      if (*p)
         suffix = p;

#ifdef	CONFIG_REVK_MESH
      if (esp_mesh_is_root () && target && ((prefixapp && *target == '*') || strncmp (target, revk_id, strlen (revk_id))))
      {                         // pass on to clients as global or not for us
         mesh_data_t data = {.proto = MESH_PROTO_MQTT };
         mesh_make_mqtt (&data, client, -1, topic, plen, payload);      // Ensures MESH_PAD space one end
         mesh_addr_t addr = {.addr = {255, 255, 255, 255, 255, 255}
         };
         if (prefixapp && *target != '*')
            for (int n = 0; n < sizeof (addr.addr); n++)
               addr.addr[n] =
                  (((target[n * 2] & 0xF) + (target[n * 2] > '9' ? 9 : 0)) << 4) + ((target[1 + n * 2] & 0xF) +
                                                                                    (target[1 + n * 2] > '9' ? 9 : 0));
         mesh_encode_send (&addr, &data, MESH_DATA_P2P);        // **** THIS EXPECTS MESH_PAD AVAILABLE EXTRA BYTES ON SIZE ****
         freez (data.data);
      }
#endif

      // NULL terminate stuff
      if (prefix && prefix > topic && prefix[-1] == '/')
         prefix[-1] = 0;
      if (target && target > topic && target[-1] == '/')
         target[-1] = 0;
      if (suffix && suffix > topic && suffix[-1] == '/')
         suffix[-1] = 0;
      if (apppart && apppart > topic && apppart[-1] == '/')
         apppart[-1] = 0;
      if (!target)
         target = "?";

      jo_t j = NULL;
      if (plen)
      {
         if (*payload != '"' && *payload != '{' && *payload != '[')
         {                      // Looks like non JSON
            if (prefix && suffix && !strcmp (prefix, topicsetting))
            {                   // Special case for settings, the suffix is the setting
               j = jo_object_alloc ();
               jo_stringf (j, suffix, "%.*s", plen, payload);
               suffix = NULL;
            } else
            {                   // Just JSON the argument
               j = jo_create_alloc ();
               int q = 0;
               if ((plen == 4 && !memcmp (payload, "true", plen)) || (plen == 5 && !memcmp (payload, "false", plen)))
                  q += plen;    // Boolean
               else
               {                // Check for int
                  if (q + 1 < plen && payload[q] == '-' && payload[q + 1] >= '0' && payload[q + 1] <= '9')
                     q++;
                  while (q < plen && payload[q] >= '0' && payload[q] <= '9')
                     q++;
                  if (q + 1 < plen && payload[q] == '.' && payload[q + 1] >= '0' && payload[q + 1] <= '9')
                  {
                     q++;
                     while (q < plen && payload[q] >= '0' && payload[q] <= '9')
                        q++;
                     // Meh, exponents?
                  }
               }
               if (plen && q == plen)
                  jo_litf (j, NULL, "%.*s", plen, payload);     // Looks safe as number
               else
                  jo_stringf (j, NULL, "%.*s", plen, payload);
            }
         } else
         {                      // Parse JSON argument
            j = jo_parse_mem (payload, plen + 1);       // +1 as we can trust a trailing NULL from lwmqtt
            jo_skip (j);        // Check whole JSON
            int pos;
            err = jo_error (j, &pos);
            if (err)
               ESP_LOGE (TAG, "Fail at pos %d, %s: (%.10s...) %.*s", pos, err, jo_debug (j), plen, payload);
         }
         jo_rewind (j);
      }
      const char *location = NULL;
      if (!err)
      {
         if (target && (!prefixapp || apppart))
         {
            if (!strcmp (target, prefixapp ? "*" : appname) || !strcmp (target, revk_id)
                || (*hostname && !strcmp (target, hostname)))
               target = NULL;   // Mark as us for simple testing by app_command, etc
#ifndef  CONFIG_REVK_OLD_SETTINGS
            else
               for (int i = 0; target && i < sizeof (topicgroup) / sizeof (*topicgroup); i++)
                  if (*topicgroup[i] && !strcmp (target, topicgroup[i]))
                     target = NULL;     // Mark as us for simple testing by app_command, etc
#endif
         }
         if (!client && prefix && !strcmp (prefix, topiccommand) && suffix && !strcmp (suffix, "upgrade"))
            err = (err ? : revk_upgrade (target, j));   // Special case as command can be to other host
         else if (!client && !target)
         {                      // For us (could otherwise be for app callback)
            if (prefix && !strcmp (prefix, topiccommand))
               err = (err ? : revk_command (suffix, j));
            else if (prefix && !strcmp (prefix, topicsetting))
            {
               err = "";
               if (!suffix && !plen)
                  b.setting_dump_requested = 1;
               else if (suffix && !strcmp (suffix, "*"))
                  b.setting_dump_requested = 2;
               else if (suffix && !strcmp (suffix, "**"))
                  b.setting_dump_requested = 3;
               else if (!suffix || strcmp (suffix, "-"))
               {
                  err = revk_settings_store (j, &location, 0);
                  if (err && !*err && app_callback)
                     app_callback (0, topiccommand, NULL, "setting", NULL);
               }
            }
            err = (err ? : ""); // Ignore
         }
      }
      if ((!err || !*err) && app_callback)
      {                         /* Pass to app, even if we handled with no error */
         jo_rewind (j);
         const char *e2 = app_callback (client, prefix, target, suffix, j);
         if (e2 && (*e2 || !err))
            err = e2;           /* Overwrite error if we did not have one */
      }
      if (!err && !target)
         err = "Unknown";
      if (err && *err)
      {
         jo_t e = jo_make (NULL);
         jo_string (e, "description", err);
         if (prefix)
            jo_string (e, "prefix", prefix);
         if (target)
            jo_string (e, "target", target);
         if (suffix)
            jo_string (e, "suffix", suffix);
         if (location)
            jo_string (e, "location", location);
         else if (plen)
            jo_string (e, "payload", (char *) payload);
         revk_error (suffix ? : prefix, &e);
      }
      jo_free (&j);
   } else if (payload)
   {
      ESP_LOGI (TAG, "MQTT%d connected %s", client, (char *) payload);
      xEventGroupSetBits (revk_group, (GROUP_MQTT << client));
      xEventGroupClearBits (revk_group, (GROUP_MQTT_DOWN << client));
      revk_send_sub (client, revk_mac); // Self
      up_next = 0;
      if (app_callback)
      {
         jo_t j = jo_object_alloc ();
         jo_int (j, "client", client);
         jo_string (j, "hostname", (char *) payload);
         jo_rewind (j);
         app_callback (client, topiccommand, NULL, "connect", j);
         jo_free (&j);
      }
   } else
   {
      if (xEventGroupGetBits (revk_group) & (GROUP_MQTT << client))
      {
         xEventGroupSetBits (revk_group, (GROUP_MQTT_DOWN << client));
         xEventGroupClearBits (revk_group, (GROUP_MQTT << client));
         ESP_LOGI (TAG, "MQTT%d disconnected", client);
         if (app_callback)
         {
            jo_t j = jo_object_alloc ();
            jo_int (j, "client", client);
            jo_rewind (j);
            app_callback (client, topiccommand, NULL, "disconnect", j);
            jo_free (&j);
         }
         // Can we flush TCP TLS stuff somehow?
      } else
      {
         ESP_LOGI (TAG, "MQTT%d failed", client);
         if (esp_get_free_heap_size () < 60000 && mqttcert[client]->len)        // Messy - pick up TLS memory leak
            revk_restart (10, "Memory issue (TLS)");
      }
   }
}
#endif

