revk/ESP32RevK/revk.c
#ifdef	CONFIG_REVK_MQTT
void
revk_mqtt_init (void)
{
#ifdef	CONFIG_REVK_MESH
   if (!esp_mesh_is_root ())
      return;                   // Indirect MQTT
#endif
   for (int client = 0; client < CONFIG_REVK_MQTT_CLIENTS; client++)
      if (*mqtthost[client] && !mqtt_client[client])
      {
         xEventGroupSetBits (revk_group, (GROUP_MQTT_DOWN << client));
         lwmqtt_client_config_t config = {
            .arg = (void *) client,
            .hostname = mqtthost[client],
            .retain = 1,
            .payload = (void *) "{\"up\":false,\"reason\":\"LWT\"}",
            .plen = -1,
            .keepalive = 30,
            .callback = &mqtt_rx,
         };
         // LWT Topic
         if (!(config.topic = revk_topic (topicstate, NULL, NULL)))
            return;             // No topic created!
         if ((strcmp (hostname, revk_id) ?      //
              asprintf ((void *) &config.client, "%s:%s_%s", appname, hostname, revk_id + 6) :  //
              asprintf ((void *) &config.client, "%s:%s", appname, hostname)) < 0)
         {
            freez (config.topic);
            return;
         }
         ESP_LOGE (TAG, "Connect MQTT%d %s as %s", client, config.hostname, config.client);
         if (mqttcert[client]->len)
         {
            config.ca_cert_ref = 1;     // No need to duplicate
            config.ca_cert_buf = (void *) mqttcert[client]->data;
            config.ca_cert_bytes = mqttcert[client]->len;
         }
#ifdef	CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
         else if (mqttport[client] == 8883)
            config.crt_bundle_attach = esp_crt_bundle_attach;
#endif
         if (clientkey->len && clientcert->len)
         {
            config.client_cert_ref = 1; // No need to duplicate
            config.client_cert_buf = (void *) clientcert->data;
            config.client_cert_bytes = clientcert->len;
            config.client_key_ref = 1;  // No need to duplicate
            config.client_key_buf = (void *) clientkey->data;
            config.client_key_bytes = clientkey->len;
         }
         if (*mqttuser[client])
            config.username = mqttuser[client];
         if (*mqttpass[client])
            config.password = mqttpass[client];
         config.port = mqttport[client];
         mqtt_client[client] = lwmqtt_client (&config);
         freez (config.topic);
         freez (config.client);
      }
}
#endif

static void
ip_event_handler (void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
   if (event_base == WIFI_EVENT)
   {
      switch (event_id)
      {
      case WIFI_EVENT_SCAN_DONE:
         ESP_LOGI (TAG, "WiFi scan done");
         break;
#ifdef	CONFIG_REVK_WIFI
      case WIFI_EVENT_AP_START:
         ESP_LOGI (TAG, "WiFi AP Start");
         if (app_callback)
         {
            jo_t j = jo_create_alloc ();
            if (*apssid)
               jo_string (j, "ssid", apssid);   // TODO the generated SSID, is this not in the event?
            jo_rewind (j);
            app_callback (0, topiccommand, NULL, "ap", j);
            jo_free (&j);
         }
         break;
      case WIFI_EVENT_STA_START:
         ESP_LOGI (TAG, "WiFi STA Start");
#ifdef CONFIG_IDF_TARGET_ESP8266
         // Fails with ESP_ERR_WIFI_IF on esp8266 if called where it was
         // originally placed. I've looked this up in examples.
         REVK_ERR_CHECK (esp_wifi_set_protocol (ESP_IF_WIFI_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N));
#endif
         break;
      case WIFI_EVENT_STA_STOP:
         ESP_LOGI (TAG, "WiFi STA Stop");
         xEventGroupClearBits (revk_group, GROUP_WIFI | GROUP_IP);
         xEventGroupSetBits (revk_group, GROUP_OFFLINE);
         break;
      case WIFI_EVENT_STA_CONNECTED:
         ESP_LOGI (TAG, "WiFi STA Connected");
         xEventGroupSetBits (revk_group, GROUP_WIFI);
#ifdef	CONFIG_LWIP_IPV6
         if (sta_netif)
            esp_netif_create_ip6_linklocal (sta_netif);
#endif
         break;
      case WIFI_EVENT_STA_DISCONNECTED:
         ESP_LOGI (TAG, "WiFi STA Disconnect");
         xEventGroupClearBits (revk_group, GROUP_WIFI | GROUP_IP);
         xEventGroupSetBits (revk_group, GROUP_OFFLINE);
         break;
      case WIFI_EVENT_AP_STOP:
         ESP_LOGI (TAG, "WiFi AP Stop");
         break;
      case WIFI_EVENT_AP_STACONNECTED:
         ESP_LOGI (TAG, "WiFi AP STA Connect");
#ifdef	CONFIG_REVK_APMODE
         apstoptime = 0;        // Stay
#endif
         break;
      case WIFI_EVENT_AP_STADISCONNECTED:
         ESP_LOGI (TAG, "WiFi AP STA Disconnect");
#ifdef	CONFIG_REVK_APMODE
         apstoptime = uptime () + 10;   // Stop ap mode soon
#endif
         break;
      case WIFI_EVENT_AP_PROBEREQRECVED:
         ESP_LOGE (TAG, "WiFi AP PROBEREQRECVED");
         break;
#ifndef CONFIG_IDF_TARGET_ESP8266
         // There's no such an event on 8266
      case WIFI_EVENT_HOME_CHANNEL_CHANGE:
         ESP_LOGI (TAG, "WiFi HOME_CHANNEL_CHANGE");
         break;
#endif
#else
#ifdef	CONFIG_REVK_MESH
      case WIFI_EVENT_AP_START:
         ESP_LOGI (TAG, "WiFi AP Start");
         break;
      case WIFI_EVENT_AP_STOP:
         ESP_LOGI (TAG, "WiFi AP Stop");
         xEventGroupSetBits (revk_group, GROUP_OFFLINE);
         break;
      case WIFI_EVENT_STA_CONNECTED:
         ESP_LOGI (TAG, "WiFi STA Connected");
#ifdef	CONFIG_LWIP_IPV6
         if (sta_netif)
            esp_netif_create_ip6_linklocal (sta_netif);
#endif
         break;
      case WIFI_EVENT_STA_DISCONNECTED:
         ESP_LOGI (TAG, "WiFi STA Disconnect");
         if (!link_down)
            link_down = uptime ();
         xEventGroupSetBits (revk_group, GROUP_OFFLINE);
         break;
      case WIFI_EVENT_AP_STACONNECTED:
         ESP_LOGI (TAG, "WiFi AP STA Connect");
         break;
      case WIFI_EVENT_AP_STADISCONNECTED:
         ESP_LOGI (TAG, "WiFi AP STA Disconnect");
         break;
      case WIFI_EVENT_HOME_CHANNEL_CHANGE:
         ESP_LOGI (TAG, "WiFi HOME_CHANNEL_CHANGE");
         break;
#endif
#endif
      default:
         // On ESP32 uint32_t, returned by this func, appears to be long, while on ESP8266 it's a pure unsigned int
         // The easiest and least ugly way to get around is to cast to long explicitly
         ESP_LOGI (TAG, "WiFi event %ld", (long) event_id);
         break;
      }
   }
   if (event_base == IP_EVENT)
   {
      switch (event_id)
      {
      case IP_EVENT_STA_LOST_IP:
#ifdef CONFIG_REVK_MESH
         if (!esp_mesh_is_root ())
            ESP_LOGI (TAG, "Lost IP, but we assume no issue as mesh");
         else
#endif
         {
            if (!link_down)
               link_down = uptime ();   // Applies for non mesh, and mesh
            gotip = 0;
            ESP_LOGI (TAG, "Lost IP");
         }
         break;
      case IP_EVENT_STA_GOT_IP:
         {
            link_down = 0;      // Applies for non mesh, and mesh
            ip_event_got_ip_t *event = (ip_event_got_ip_t *) event_data;
            if (event->ip_changed)
               gotip &= ~0x80;  // IPv4 changed
            if (!(gotip & 0x80))
            {                   // New IPv4
               wifi_ap_record_t ap = { };
               REVK_ERR_CHECK (esp_wifi_sta_get_ap_info (&ap));
               // Done as Error level as really useful if logging at all
               ESP_LOGE (TAG, "Got IPv4 " IPSTR " from %s", IP2STR (&event->ip_info.ip), (char *) ap.ssid);
               if (sta_netif)
               {
#if     ESP_IDF_VERSION_MAJOR > 5 || ESP_IDF_VERSION_MAJOR == 5 && ESP_IDF_VERSION_MINOR > 0
                  esp_sntp_stop ();
                  esp_sntp_init ();
#else
                  sntp_stop ();
                  sntp_init ();
#endif
               }
#ifdef	CONFIG_REVK_MQTT
               revk_mqtt_init ();
#endif
#ifdef  CONFIG_REVK_WIFI
               xEventGroupSetBits (revk_group, GROUP_WIFI);
               if (app_callback)
               {
                  jo_t j = jo_object_alloc ();
                  jo_string (j, "ssid", (char *) ap.ssid);
                  //if (ap.phy_lr) jo_bool (j, "lr", 1); // This just says it can do LR, not that we are using LR
                  jo_stringf (j, "ip", IPSTR, IP2STR (&event->ip_info.ip));
                  jo_stringf (j, "gw", IPSTR, IP2STR (&event->ip_info.gw));
                  jo_rewind (j);
                  app_callback (0, topiccommand, NULL, "wifi", j);
                  jo_free (&j);
               }
#endif
#ifdef	CONFIG_REVK_APMODE
               apstoptime = uptime () + 60;     // Stop ap mode soon
#endif
               gotip |= 0x80;   // Got the IPv4
            }
            xEventGroupSetBits (revk_group, GROUP_IP);
         }
         break;
      case IP_EVENT_GOT_IP6:
         {
            ip_event_got_ip6_t *event = (ip_event_got_ip6_t *) event_data;
#ifdef CONFIG_IDF_TARGET_ESP8266
            int ip_index = 0;   // 8266-IDF only supports a single address
#else
            int ip_index = event->ip_index;
#endif
            if (ip_index < 7 && !(gotip & (1 << ip_index)))
            {                   // New IPv6
               // Done as Error level as really useful if logging at all
               ESP_LOGE (TAG, "Got IPv6 [%d] " IPV6STR " (%d)", ip_index, IPV62STR (event->ip6_info.ip), event->ip6_info.ip.zone);
               if (!event->ip6_info.ip.zone)
                  b.gotipv6 = 1;
#ifdef  CONFIG_REVK_WIFI
               if (app_callback)
               {
                  jo_t j = jo_object_alloc ();
                  jo_stringf (j, "ipv6", IPV6STR, IPV62STR (event->ip6_info.ip));
                  jo_int (j, "zone", event->ip6_info.ip.zone);
                  app_callback (0, topiccommand, NULL, "ipv6", j);
                  jo_free (&j);
               }
#endif
               gotip |= (1 << ip_index);
            }
         }
         break;
      default:
         ESP_LOGI (TAG, "IP event %ld", (long) event_id);
         break;
      }
   }
#ifdef	CONFIG_REVK_MESH
   if (event_base == MESH_EVENT)
   {
      switch (event_id)
      {
      case MESH_EVENT_STOPPED:
         ESP_LOGI (TAG, "Mesh STA Stop");
         xEventGroupClearBits (revk_group, GROUP_WIFI | GROUP_IP);
         xEventGroupSetBits (revk_group, GROUP_OFFLINE);
         revk_mqtt_close ("Mesh gone");
         break;
      case MESH_EVENT_PARENT_CONNECTED:
         {
            if (esp_mesh_is_root ())
            {
               ESP_LOGI (TAG, "Mesh root");
               setup_ip ();     // Handles starting dhcp or setting link_down
            } else
            {
               ESP_LOGI (TAG, "Mesh child");
               stop_ip ("Mesh child");
               if (link_down)
               {
                  ESP_LOGI (TAG, "Link up");
                  link_down = 0;        // As child we assume parent has a link
               }
               up_next = 0;
            }
            xEventGroupClearBits (revk_group, GROUP_OFFLINE);
         }
         break;
      case MESH_EVENT_PARENT_DISCONNECTED:
      case MESH_EVENT_NO_PARENT_FOUND:
         if (!link_down)
         {
            link_down = uptime ();
            ESP_LOGI (TAG, "Mesh Link down");
         }
         if (b.mesh_root_known)
         {
            ESP_LOGI (TAG, "Mesh root lost");
            b.mesh_root_known = 0;
         }
         stop_ip ("Mesh gone");
         xEventGroupSetBits (revk_group, GROUP_OFFLINE);
         break;
      case MESH_EVENT_ROOT_ADDRESS:    // We know the root
         if (!b.mesh_root_known)
         {
            ESP_LOGI (TAG, "Mesh root known");
            b.mesh_root_known = 1;
         }
         break;
      case MESH_EVENT_STARTED:
                              /**< mesh is started */
         ESP_LOGI (TAG, "Mesh STARTED");
         break;
      case MESH_EVENT_CHANNEL_SWITCH:
                                     /**< channel switch */
         ESP_LOGI (TAG, "Mesh CHANNEL_SWITCH");
         break;
      case MESH_EVENT_CHILD_CONNECTED:
                                      /**< a child is connected on softAP interface */
         ESP_LOGI (TAG, "Mesh CHILD_CONNECTED");
         break;
      case MESH_EVENT_CHILD_DISCONNECTED:
                                         /**< a child is disconnected on softAP interface */
         ESP_LOGI (TAG, "Mesh CHILD_DISCONNECTED");
         break;
      case MESH_EVENT_ROUTING_TABLE_ADD:
                                        /**< routing table is changed by adding newly joined children */
         ESP_LOGI (TAG, "Mesh ROUTING_TABLE_ADD");
         break;
      case MESH_EVENT_ROUTING_TABLE_REMOVE:
                                           /**< routing table is changed by removing leave children */
         ESP_LOGI (TAG, "Mesh ROUTING_TABLE_REMOVE");
         break;
      case MESH_EVENT_LAYER_CHANGE:
                                   /**< layer changes over the mesh network */
         ESP_LOGI (TAG, "Mesh LAYER_CHANGE");
         break;
      case MESH_EVENT_TODS_STATE:
                                 /**< state represents whether the root is able to access external IP network.
                                               This state is a manual event that needs to be triggered with esp_mesh_post_toDS_state(). */
         ESP_LOGI (TAG, "Mesh TODS_STATE");
         break;
      case MESH_EVENT_VOTE_STARTED:
                                   /**< the process of voting a new root is started either by children or by the root */
         ESP_LOGI (TAG, "Mesh VOTE_STARTED");
         break;
      case MESH_EVENT_VOTE_STOPPED:
                                   /**< the process of voting a new root is stopped */
         ESP_LOGI (TAG, "Mesh VOTE_STOPPED");
         break;
      case MESH_EVENT_ROOT_SWITCH_REQ:
                                      /**< root switch request sent from a new voted root candidate */
         ESP_LOGI (TAG, "Mesh ROOT_SWITCH_REQ");
         break;
      case MESH_EVENT_ROOT_SWITCH_ACK:
                                      /**< root switch acknowledgment responds the above request sent from current root */
         ESP_LOGI (TAG, "Mesh ROOT_SWITCH_ACK");
         break;
      case MESH_EVENT_ROOT_ASKED_YIELD:
                                       /**< the root is asked yield by a more powerful existing root. If self organized is disabled
                                               and this device is specified to be a root by users, users should set a new parent
                                               for this device. if self organized is enabled, this device will find a new parent
                                               by itself, users could ignore this event. */
         ESP_LOGI (TAG, "Mesh ROOT_ASKED_YIELD");
         break;
      case MESH_EVENT_ROOT_FIXED:
                                 /**< when devices join a network, if the setting of Fixed Root for one device is different
                                               from that of its parent, the device will update the setting the same as its parent's.
                                               Fixed Root Setting of each device is variable as that setting changes of the root. */
         ESP_LOGI (TAG, "Mesh ROOT_FIXED");
         break;
      case MESH_EVENT_SCAN_DONE:
                                /**< if self-organized networking is disabled, user can call esp_wifi_scan_start() to trigger
                                               this event, and add the corresponding scan done handler in this event. */
         ESP_LOGI (TAG, "Mesh SCAN_DONE");
         break;
      case MESH_EVENT_NETWORK_STATE:
                                    /**< network state, such as whether current mesh network has a root. */
         ESP_LOGI (TAG, "Mesh NETWORK_STATE");
         break;
      case MESH_EVENT_STOP_RECONNECTION:
                                        /**< the root stops reconnecting to the router and non-root devices stop reconnecting to their parents. */
         ESP_LOGI (TAG, "Mesh STOP_RECONNECTION");
         break;
      case MESH_EVENT_FIND_NETWORK:
                                   /**< when the channel field in mesh configuration is set to zero, mesh stack will perform a
                                               full channel scan to find a mesh network that can join, and return the channel value
                                               after finding it. */
         ESP_LOGI (TAG, "Mesh FIND_NETWORK");
         break;
      case MESH_EVENT_ROUTER_SWITCH:
                                    /**< if users specify BSSID of the router in mesh configuration, when the root connects to another
                                               router with the same SSID, this event will be posted and the new router information is attached. */
         ESP_LOGI (TAG, "Mesh ROUTER_SWITCH");
         break;
      case MESH_EVENT_PS_PARENT_DUTY:
                                     /**< parent duty */
         ESP_LOGI (TAG, "Mesh PS_PARENT_DUTY");
         break;
      case MESH_EVENT_PS_CHILD_DUTY:
                                    /**< child duty */
         ESP_LOGI (TAG, "Mesh PS_CHILD_DUTY");
         break;
      case MESH_EVENT_PS_DEVICE_DUTY:
                                     /**< device duty */
         ESP_LOGI (TAG, "Mesh PS_DEVICE_DUTY");
         break;
      default:
         ESP_LOGI (TAG, "Mesh event %ld", (long) event_id);
         break;
      }
   }
#endif
}

static const char *
blink_default (const char *user)
{                               // What blinking to do - NULL means do default, "" means off if none of the default special cases apply, otherwise the requested colour sequence, unless restarting (white)
   if (restart_time)
      return "W";               // Rebooting - override user even
   if (user && *user)
      return user;
   if (!*wifissid)
      return "RW";              // No wifi SSID
#ifdef  CONFIG_REVK_APMODE
   wifi_mode_t mode = 0;
   esp_wifi_get_mode (&mode);
   if (mode == WIFI_MODE_APSTA)
      return "BW";              // AP+sta mode
   if (mode == WIFI_MODE_AP)
      return "CW";              // AP mode only
   if (mode == WIFI_MODE_NULL)
      return "MW";              // Off?
#endif
   if (!(xEventGroupGetBits (revk_group) & GROUP_WIFI))
      return "MW";              // No WiFi
   if (revk_link_down ())
      return "YW";              // Link down
   if (user || dark)
      return "K";
   return "RYGCBM";             // Idle
}

uint32_t
revk_rgb (char c)
{                               // Map colour character to RGB - maybe expand to handle more colours later. Returns RGB in low bytes, then 2 bits per RGB in bits 24 to 29. Bit 30 if not black. Bit 31 clear.
   char u = toupper (c);
#ifdef	CONFIG_REVK_RGB_MAX_R
   uint8_t r = (u == 'R' || u == 'O' ? CONFIG_REVK_RGB_MAX_R : u == 'Y'
                || u == 'M' ? CONFIG_REVK_RGB_MAX_R * 2 / 3 : u == 'W' ? CONFIG_REVK_RGB_MAX_R / 2 : 0);
   uint8_t g = (u == 'G' ? CONFIG_REVK_RGB_MAX_G : u == 'Y' || u == 'C'
                || u == 'O' ? CONFIG_REVK_RGB_MAX_G * 2 / 3 : u == 'W' ? CONFIG_REVK_RGB_MAX_G / 2 : 0);
   uint8_t b = (u == 'B' ? CONFIG_REVK_RGB_MAX_B : u == 'M'
                || u == 'C' ? CONFIG_REVK_RGB_MAX_B * 2 / 3 : u == 'W' ? CONFIG_REVK_RGB_MAX_B / 2 : 0);
#else
   uint8_t r = (u == 'R' ? 0xFF : u == 'Y' || u == 'M' ? 0xFF / 2 : u == 'W' ? 0xFF / 3 : 0);
   uint8_t g = (u == 'G' ? 0xFF : u == 'Y' || u == 'C' ? 0xFF / 2 : u == 'W' ? 0xFF / 3 : 0);
   uint8_t b = (u == 'B' ? 0xFF : u == 'M' || u == 'C' ? 0xFF / 2 : u == 'W' ? 0xFF / 3 : 0);
#endif
   if (islower (c))
   {                            // Dim
      r /= 2;
      g /= 2;
      b /= 2;
   }
   uint32_t rgb = (r << 16) + (g << 8) + b;
   // Add simple bits for colour
   rgb |= ((u == 'R' || u == 'Y' || u == 'M' || u == 'W' || u == 'O' ? 3 : 0) << 28);
   rgb |= ((u == 'G' || u == 'Y' || u == 'C' || u == 'W' ? 3 : u == 'O' ? 1 : 0) << 26);
   rgb |= ((u == 'B' || u == 'M' || u == 'C' || u == 'W' ? 3 : 0) << 24);
   if (u && u != 'K')
      rgb |= 0x40000000;
   return rgb;
}

#ifdef	CONFIG_REVK_LED_STRIP
const uint8_t gamma8[256] = {
   0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
   0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
   1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2,
   2, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 5, 5, 5,
   5, 6, 6, 6, 6, 7, 7, 7, 7, 8, 8, 8, 9, 9, 9, 10,
   10, 10, 11, 11, 11, 12, 12, 13, 13, 13, 14, 14, 15, 15, 16, 16,
   17, 17, 18, 18, 19, 19, 20, 20, 21, 21, 22, 22, 23, 24, 24, 25,
   25, 26, 27, 27, 28, 29, 29, 30, 31, 32, 32, 33, 34, 35, 35, 36,
   37, 38, 39, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 50,
   51, 52, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 66, 67, 68,
   69, 70, 72, 73, 74, 75, 77, 78, 79, 81, 82, 83, 85, 86, 87, 89,
   90, 92, 93, 95, 96, 98, 99, 101, 102, 104, 105, 107, 109, 110, 112, 114,
   115, 117, 119, 120, 122, 124, 126, 127, 129, 131, 133, 135, 137, 138, 140, 142,
   144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 167, 169, 171, 173, 175,
   177, 180, 182, 184, 186, 189, 191, 193, 196, 198, 200, 203, 205, 208, 210, 213,
   215, 218, 220, 223, 225, 228, 231, 233, 236, 239, 241, 244, 247, 249, 252, 255
};

void
revk_led (led_strip_handle_t strip, int led, uint8_t scale, uint32_t rgb)
{                               // Set LED strip with gamma
   if (strip)
      led_strip_set_pixel (strip, led,  //
                           gamma8[scale * ((rgb >> 16) & 255) / 255],   //
                           gamma8[scale * ((rgb >> 8) & 255) / 255],    //
                           gamma8[scale * ((rgb >> 0) & 255) / 255]);
}
#endif

uint32_t
revk_blinker (void)
{                               // LED blinking controls, in style of revk_rgb() but bit 30 is set if not black, and bit 31 is set for blink cycle
   if (b.die)
      return 0;
   if (uptime () < 2)
      return 0x4C00FF00;        // Green startup
   if (b.factorycount == 1)
      return 0x7CFFFF00;        // Factory reset
   if (b.factorycount == 2)
      return 0x48FF8800;        // Factory reset
   if (b.factorycount == 3)
      return 0x70FF0000;        // Factory reset
   static uint32_t rgb = 0;     // Current colour (2 bits per)
   static uint8_t tick = 255;   // Blink cycle counter
   uint8_t on = blink_on,       // Current on/off times
      off = blink_off;
#if     defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MQTT)
   if (!on && !off)
      on = off = (revk_link_down ()? 3 : 6);
#endif
   if (!off)
      off = 1;
   if (++tick >= on + off)
   {                            // End of cycle, work out next colour
      tick = 0;
      static const char *c = "",
         *last = NULL;
      const char *base = blink_default (blink_colours); // Always has one colour, even if black
      if (base != last)
         c = last = base;       // Restart sequence if changed
      if (!*c)
         c = base;              // End of sequence to loop
      char col = *c++;          // Next colour
      rgb = revk_rgb (col);
   }
   // Updated LED every 10th second
   if (tick < on)
   {
      uint8_t scale = 255 * (tick + 1) / on;
      return ((scale * ((rgb >> 16) & 0xFF) / 255) << 16) + ((scale * ((rgb >> 8) & 0xFF) / 255) << 8) +
         (scale * (rgb & 0xFF) / 255) + (rgb & 0x7F000000) + 0x80000000;;
   } else
   {
      uint8_t scale = 255 * (on + off - tick - 1) / off;
      return ((scale * ((rgb >> 16) & 0xFF) / 255) << 16) + ((scale * ((rgb >> 8) & 0xFF) / 255) << 8) +
         (scale * (rgb & 0xFF) / 255);
   }
}

