revk/ESP32RevK/revk.c
#ifdef	CONFIG_REVK_BLINK_SUPPORT
void
revk_blink_init (void)
{                               // LED blinking initialisation
#ifdef CONFIG_REVK_LED_STRIP
   if (blink[0].set && blink[1].set && blink[0].num == blink[1].num)
   {
      if (!(gpio_ok (blink[0].num) & 1))
      {
         ESP_LOGE (TAG, "Not using LED GPIO %d", blink[0].num);
         blink[0].set = 0;
      } else
      {                         // Initialise the LED strip for one LED. This can, however, be pre-set by the app where we will refresh every 10th second and set 1st LED for status
         led_strip_config_t strip_config = {
            .strip_gpio_num = (blink[0].num),
            .max_leds = 1,      // The number of LEDs in the strip,
#ifdef	LED_STRIP_COLOR_COMPONENT_FMT_GRB
            .color_component_format = LED_STRIP_COLOR_COMPONENT_FMT_GRB,
#else
            .led_pixel_format = LED_PIXEL_FORMAT_GRB,
#endif
            .led_model = LED_MODEL_WS2812,      // LED strip model
            .flags.invert_out = blink[0].invert,        // whether to invert the output signal (useful when your hardware has a level inverter)
         };
         led_strip_rmt_config_t rmt_config = {
            .clk_src = RMT_CLK_SRC_DEFAULT,     // different clock source can lead to different power consumption
            .resolution_hz = 10 * 1000 * 1000,  // 10MHz
            // One LED so no need for DMA
         };
         REVK_ERR_CHECK (led_strip_new_rmt_device (&strip_config, &rmt_config, &revk_strip));
      }
   } else
#endif
      for (int b = 0; b < sizeof (blink) / sizeof (*blink); b++)
      {
         if (blink[b].set)
         {
            uint8_t p = blink[b].num;
            if (!(gpio_ok (p) & 1))
            {
               ESP_LOGE (TAG, "Not using LED GPIO %d", p);
               blink[b].set = 0;
               continue;
            }
            revk_gpio_output (blink[b], 0);
         }
      }
   revk_blink_do ();
}
#endif

#ifdef  CONFIG_REVK_BLINK_SUPPORT
void
revk_blink_do (void)
{                               // Drive LED
   if (blink[0].set)
   {
      uint32_t rgb = revk_blinker ();
      if (!blink[1].set)
         revk_gpio_set (blink[0], (rgb >> 31) & 1);
      else if (blink[0].num != blink[1].num)
      {                         // Separate RGB on
         revk_gpio_set (blink[0], (rgb >> 29) & 1);
         revk_gpio_set (blink[1], (rgb >> 27) & 1);
         revk_gpio_set (blink[2], (rgb >> 25) & 1);
      }
#ifdef  CONFIG_REVK_LED_STRIP
      else if (revk_strip)
      {
         revk_led (revk_strip, 0, 255, rgb);
         led_strip_refresh (revk_strip);
      }
#endif
   }
}
#endif

static void
task (void *pvParameters)
{                               /* Main RevK task */
   if (watchdogtime)
      compat_task_wdt_add ();
   pvParameters = pvParameters;
   /* Log if unexpected restart */
   int64_t tick = 0;
   uint32_t ota_check = 0;
   if (otaauto)
   {
      if (otabeta)
         ota_check = 86400 - 1800 + (esp_random () % 3600);     //  A day ish
      else if (otastart)
         ota_check = otastart + (esp_random () % otastart);     // Check at start anyway
      else if (otadays)
         ota_check = 86400 * otadays + (esp_random () % 3600);  // Min periodic check
   }
#ifdef	CONFIG_REVK_BLINK_LIB
   revk_blink_init ();
#endif
   revk_gpio_input (factorygpio);
   while (1)
   {                            /* Idle */
      if (!b.wdt_test && watchdogtime)
         esp_task_wdt_reset ();
      {                         // Fast (once per 100ms)
         int64_t now = esp_timer_get_time ();
         if (now < tick)
         {                      /* wait for next 10th, so idle task runs */
            usleep (tick - now);
            now = tick;
         }
         tick += 100000ULL;     /* 10th second */
#ifdef CONFIG_REVK_BLINK_LIB
         revk_blink_do ();
#endif
         if (b.setting_dump_requested)
         {                      // Done here so not reporting from MQTT
            revk_setting_dump (b.setting_dump_requested);
            b.setting_dump_requested = 0;
         }
         if (factorygpio.set)
         {                      // Factory reset control - press 3 times without a 3 second gap
            uint8_t press = revk_gpio_get (factorygpio);
            if (press && !b.factorywas)
            {
               if (b.factorycount < 3)
                  b.factorycount++;
               ESP_LOGE (TAG, "Pressed factory reset button %d", b.factorycount);
               b.factorytick = 0;
               if (b.factorycount == 3)
               {                // Do factory reset
                  const esp_app_desc_t *app = esp_app_get_description ();
                  revk_settings_factory (TAG, app->project_name, 0);
                  revk_restart (3, "Factory reset");
               }
            }
            b.factorywas = press;
            if (b.factorytick == 30)
               b.factorycount = 0;      // Timeout
            if (b.factorytick < 31)
               b.factorytick++;
         }
      }
      static uint32_t last = 0;
      uint32_t now = uptime ();
      if (now != last)
      {                         // Slow (once a second)
         last = now;
         if (b.gotipv6)
         {                      // Stuff that may be useful when we get an IPv6 address
            b.gotipv6 = 0;
#ifdef	CONFIG_REVK_MQTT
            for (int i = 0; i < CONFIG_REVK_MQTT_CLIENTS; i++)
               lwmqtt_reconnect6 (mqtt_client[i]);
#endif
         }
         if (!b.disableupgrade && otaauto && ota_check && ota_check < now)
         {                      // Check for s/w update
            time_t t = time (0);
            struct tm tm = { 0 };
            localtime_r (&t, &tm);
            if (now > 7200 && tm.tm_hour >= 6)
               ota_check = now + (esp_random () % 21600);       // A periodic check should be in the middle of the night, so wait a bit more (<7200 is a startup check)
            else
            {                   // Do a check
               if (otabeta)
                  ota_check = now + 86400 - 1800 + (esp_random () % 3600);      // A day ish
               else if (otadays)
                  ota_check = now + 86400 * otadays - 43200 + (esp_random () % 86400);  // Next check approx otadays days later
               else
                  ota_check = 0;
#ifdef CONFIG_REVK_MESH
               if (esp_mesh_is_root ())
#endif
                  revk_upgrade (NULL, NULL);    // Checks for upgrade
            }
         }
         {
#if     defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
            if (!b.disablewifi && *wifissid && (xEventGroupGetBits (revk_group) & (GROUP_OFFLINE)))
            {                   // Link down, do regular connect attempts
               wifi_mode_t mode = 0;
               esp_wifi_get_mode (&mode);
               if ((!(now % 10) && mode == WIFI_MODE_APSTA) || mode == WIFI_MODE_STA    // Slower when APSTA
#ifdef	CONFIG_REVK_MESH
                   || meshroot
#endif
                  )
               {
#ifdef	CONFIG_REVK_MESH
                  ESP_LOGE (TAG, "Connect %s", meshroot ? wifissid : "mesh");
#else
                  ESP_LOGE (TAG, "Connect %s", wifissid);
#endif
                  xEventGroupClearBits (revk_group, GROUP_OFFLINE);
                  esp_wifi_connect ();
               }
            }
#endif
            char mq[30] = "";
#ifdef CONFIG_REVK_MESH
            if (esp_mesh_is_root ())
#endif
            {
#ifdef	CONFIG_REVK_MQTT
               // on ESP8266 uint32_t is just unsigned int, need to explicitly
               // cast to unsigne long to avoid compiler errors
               sprintf (mq, " MQTT %lu", (unsigned long) lwmqtt_connected (mqtt_client[0]));
#if	    CONFIG_REVK_MQTT_CLIENTS>1
               sprintf (mq + strlen (mq), "/%lu", (unsigned long) lwmqtt_connected (mqtt_client[1]));
#endif
#endif
            }
#ifdef CONFIG_REVK_MESH
            ESP_LOGI (TAG, "Up %lu, Link down %lu, Mesh nodes %lu%s%s", (unsigned long) now, (unsigned long) revk_link_down (),
                      (unsigned long) esp_mesh_get_total_node_num (),
                      esp_mesh_is_root ()? " (root)" : b.mesh_root_known ? " (leaf)" : " (no-root)", mq);
#else
#ifdef	CONFIG_REVK_WIFI
            ESP_LOGI (TAG, "Up %lu, Link %s %lu%s", (unsigned long) now, b.disablewifi ? "disabled" : "down",
                      (unsigned long) revk_link_down (), mq);
#else
            ESP_LOGI (TAG, "Up %lu%s", (unsigned long) now, mq);
#endif
            if (!b.disablewifi && wifiuptime && now > wifiuptime && !restart_time)
               revk_disable_wifi ();
#endif
         }
#ifdef	CONFIG_REVK_MQTT
         {                      // Report even if not on-line as mesh works anyway
            static uint8_t lastch = 0;
            static mac_t lastbssid;
            static uint32_t lastheap = 0;
            static uint32_t lastheapspi = 0;
            uint32_t heapspi = heap_caps_get_free_size (MALLOC_CAP_SPIRAM);
            uint32_t heap = esp_get_free_heap_size () - heapspi;
            wifi_ap_record_t ap = {
            };
            esp_wifi_sta_get_ap_info (&ap);
            if (lastch != ap.primary || memcmp (lastbssid, ap.bssid, 6) || heap / 10000 < lastheap / 10000
                || heapspi / 10000 < lastheapspi / 10000 || now > up_next || restart_time)
            {
               if (restart_time && ota_task_id)
                  restart_time++;       // wait
               jo_t j = jo_make (NULL);
               jo_string (j, "id", revk_id);
               jo_bool (j, "up", 1);
               jo_int (j, "uptime", now);
               {                // MQTT up
                  int i = 0;
                  for (i = 0; i < CONFIG_REVK_MQTT_CLIENTS && *mqtthost[i]; i++);
                  if (i == 1)
                     jo_int (j, "mqtt-up", lwmqtt_connected (mqtt_client[0]));  // One client
                  else
                  {
                     jo_array (j, "mqtt-up");
                     for (i = 0; i < CONFIG_REVK_MQTT_CLIENTS && *mqtthost[i]; i++)
                        jo_int (j, NULL, lwmqtt_connected (mqtt_client[i]));
                     jo_close (j);
                  }
               }
               if (restart_time)
               {
                  jo_int (j, "restart", restart_time >= now ? restart_time - now : 0);
                  jo_string (j, "reason", restart_reason);
               }
               if (!up_next)
               {                // some unchanging stuff
#ifdef	CONFIG_SECURE_BOOT
                  jo_bool (j, "secureboot", 1);
#endif
#ifdef	CONFIG_NVS_ENCRYPTION
                  jo_bool (j, "nvsecryption", 1);
#endif
                  jo_string (j, "app", appname);
                  jo_string (j, "version", revk_version);
                  jo_string (j, "build-suffix", revk_build_suffix);
                  {             // Stupid format Jul 10 2021
                     char temp[20];
                     if (revk_build_date (temp))
                        jo_string (j, "build", temp);
                  }
                  {
                     uint32_t size_flash_chip;
                     esp_flash_get_size (NULL, &size_flash_chip);
                     jo_int (j, "flash", size_flash_chip);
                  }
                  jo_int (j, "rst", esp_reset_reason ());
               }
               if (!up_next || heapspi / 10000 < lastheapspi / 10000 || heap / 10000 < lastheap / 10000)
               {
                  jo_int (j, "mem", heap);
                  if (heapspi)
                     jo_int (j, "spi", heapspi);
               }
               if (!up_next || lastch != ap.primary || memcmp (lastbssid, ap.bssid, 6))
               {                // Wifi
                  jo_string (j, "ssid", (char *) ap.ssid);
                  jo_stringf (j, "bssid", "%02X%02X%02X%02X%02X%02X", (uint8_t) ap.bssid[0], (uint8_t) ap.bssid[1],
                              (uint8_t) ap.bssid[2], (uint8_t) ap.bssid[3], (uint8_t) ap.bssid[4], (uint8_t) ap.bssid[5]);
                  jo_int (j, "rssi", ap.rssi);
                  jo_int (j, "chan", ap.primary);
                  if (sta_netif)
                  {
                     {
                        esp_netif_ip_info_t ip;
                        if (!esp_netif_get_ip_info (sta_netif, &ip) && ip.ip.addr)
                           jo_stringf (j, "ipv4", IPSTR, IP2STR (&ip.ip));
                     }
#ifdef CONFIG_LWIP_IPV6
                     {
                        esp_ip6_addr_t ip;
                        if (!esp_netif_get_ip6_global (sta_netif, &ip))
                           jo_stringf (j, "ipv6", IPV6STR, IPV62STR (ip));
                     }
#endif
                  }
               }
#ifdef	CONFIG_REVK_STATE_EXTRA
               extern void revk_state_extra (jo_t);
               revk_state_extra (j);
#endif
               revk_state_clients (NULL, &j, -1);       // up message goes to all servers
               lastheap = heap;
               lastheapspi = heapspi;
               lastch = ap.primary;
               memcpy (lastbssid, ap.bssid, 6);
               up_next = now + 3600;
            }
         }
#endif
         if (!b.disablewifi)
         {
#ifdef  CONFIG_REVK_MESH
            if (esp_mesh_is_root ())
            {                   // Root reset is if wifireset and alone, or mesh reset even if not alone
               if ((wifireset && revk_link_down () > wifireset && esp_mesh_get_total_node_num () <= 1)
                   || (meshreset && revk_link_down () > meshreset))
                  revk_restart (0, "Mesh sucks");
            } else
            {                   // Leaf reset if only if link down (meaning alone)
               if (wifireset && revk_link_down () > wifireset)
                  revk_restart (0, "Mesh sucks");
            }
#else
#ifdef	CONFIG_REVK_WIFI
            if (wifireset && revk_link_down () > wifireset)
               revk_restart (0, "Offline too long");
#endif
#endif
         }
#ifdef	CONFIG_REVK_APMODE
         if (!b.disableap && apgpio.set && revk_gpio_get (apgpio))
         {
            ap_start ();
            if (aptime)
               apstoptime = now + aptime;
         }
#if     defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MQTT)
         if (!b.disableap && apwait && revk_link_down () > apwait)
            ap_start ();
#endif
#ifdef	CONFIG_REVK_WIFI
         if (!b.disableap && !*wifissid)
            ap_start ();
#endif
         if (apstoptime && apstoptime < now)
            ap_stop ();
#endif
         if (revk_nvs_time && revk_nvs_time < now)
         {
            revk_settings_commit ();
            revk_nvs_time = 0;
         }
         if (restart_time && restart_time <= now)
            break;
      }
   }
   revk_pre_shutdown ();
   esp_restart ();
}

void
revk_pre_shutdown (void)
{                               /* Restart */
   b.die = 1;
#ifdef CONFIG_REVK_BLINK_LIB
   revk_blink_do ();
#endif
   if (!restart_reason)
      restart_reason = "Unknown";
   ESP_LOGI (TAG, "Restart %s", restart_reason);
   revk_settings_commit ();
   if (app_callback)
   {
      jo_t j = jo_create_alloc ();
      jo_string (j, NULL, restart_reason);
      jo_rewind (j);
      app_callback (0, topiccommand, NULL, "shutdown", j);
      jo_free (&j);
   }
   revk_mqtt_close (restart_reason);
#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
   if (sta_netif)
      revk_wifi_close ();
#endif
   restart_time = 0;
}

int
gpio_ok (int8_t p)
{                               // Return is bit 0 (i.e. value 1) for output OK, 1 (i.e. value 2) for input OK. bit 2 USB (not marked in/out), bit 3 for Serial (are marked in/out as well)
   if (!GPIO_IS_VALID_GPIO (p))
      return 0;                 // Catch all
   // ESP32 (S1)
#ifdef	CONFIG_IDF_TARGET_ESP32
   if (p > 39)
      return 0;
#ifdef	CONFIG_REVK_D4
   if (p == 6 || (p >= 8 && p <= 11) || (p >= 16 && p <= 18) || p == 20 || (p >= 23 && p <= 24) || (p >= 28 && p <= 31))
      return 0;
#else
#ifdef	CONFIG_REVK_PICO
   if (p == 6 || (p >= 9 && p <= 11) || (p >= 16 && p <= 18) || (p >= 23 && p <= 24) || (p >= 28 && p <= 31))
      return 0;
#else
   if ((p >= 6 && p <= 11) || p == 20 || p == 24 || (p >= 28 && p <= 31) || (p >= 37 && p <= 38))
      return 0;
#ifdef CONFIG_ESP32_SPIRAM_SUPPORT
   if (p >= 16 && p <= 17)
      return 0;
#endif
#ifdef	CONFIG_FREERTOS_UNICORE
   if (p >= 16 && p <= 17)      // Shelly, seem to run in to issues with these
      return 0;
#endif
#endif
#endif
   if (p >= 34)
      return 2;                 // Input only
   if (p == 1 || p == 3)
      return 3 + 8;             // Serial       
   return 3;                    // Input and output
#endif
   // ESP32 (S3)
#ifdef	CONFIG_IDF_TARGET_ESP32S3
   if (p > 48)
      return 0;
   if (p == 19 || p == 20)
      return 4;                 // special use (USB)
   if ((p >= 22 && p <= 25) || (p >= 27 && p <= 32))
      return 0;
#ifdef	CONFIG_SPIRAM
   if (p == 26)
      return 0;
#endif
   if (p == 43 || p == 44)
      return 3 + 8;             // Serial
   return 3;                    // All input and output
#endif
   // ESP32 (C3)
#ifdef	CONFIG_IDF_TARGET_ESP32C3
   if (p > 21)
      return 0;
   if (p == 18 || p == 19)
      return 4;                 // special use (USB)
   if (p >= 12 && p <= 17)
      return 0;
   return 3;                    // All input and output
#endif
   // ESP8266
#ifdef CONFIG_IDF_TARGET_ESP8266
   // PLEASE do not remove this!!! Hitting any of these GPIOs in revk_boot()
   // causes the whole system to lock up.
   if (p == 1 || p == 3)
      return 3 + 8;             // Serial
   if (p >= 6 && p <= 11)
      return 0;                 // SDIO; attempt to configure causes crash
   // 8266 has GPIOs 0...16, allow any use except above
   return (p <= 16) ? 3 : 0;
#endif
}

