revk/ESP32RevK/revk.c
/* External functions */
void
revk_boot (app_callback_t * app_callback_cb)
{                               /* Start the revk task, use __FILE__ and __DATE__ and __TIME__ to set task name and version ID */
#ifdef	CONFIG_REVK_GPIO_INIT
   {                            // Safe GPIO
      gpio_config_t i = {.mode = GPIO_MODE_INPUT };
      for (uint8_t p = 0; p <= 48; p++)
         if (gpio_ok (p) == 3)  // Input and output, not serial
            i.pin_bit_mask |= (1LL << p);
      //ESP_LOGE (TAG, "Input to read level %016llX", i.pin_bit_mask);
      gpio_config (&i);
      gpio_config_t u = {.pull_up_en = 1,.mode = GPIO_MODE_DISABLE };
      gpio_config_t d = {.pull_down_en = 1,.mode = GPIO_MODE_DISABLE };
      for (uint8_t p = 0; p <= 48; p++)
         if (gpio_ok (p) == 3)  // Input and output, not serial
         {
            if (gpio_get_level (p))
               u.pin_bit_mask |= (1LL << p);
            else
               d.pin_bit_mask |= (1LL << p);
         }
      if (u.pin_bit_mask)
      {
         //ESP_LOGE (TAG, "Pull up %016llX", u.pin_bit_mask);
         gpio_config (&u);
      }
      if (d.pin_bit_mask)
      {
         //ESP_LOGE (TAG, "Pull down %016llX", d.pin_bit_mask);
         gpio_config (&d);
      }
   }
#endif
#ifdef	CONFIG_REVK_MESH
   esp_wifi_disconnect ();      // Just in case
   mesh_mutex = xSemaphoreCreateBinary ();
   xSemaphoreGive (mesh_mutex);
   mesh_ota_sem = xSemaphoreCreateBinary ();    // Leave in taken, only given on ack received
#endif
#ifdef	CONFIG_REVK_PARTITION_CHECK
   {                            // Only if we are in the first OTA partition, else changes could be problematic
      const esp_partition_t *ota_partition = esp_ota_get_running_partition ();
      ESP_LOGI (TAG, "Running from %s at %lX (size %lu)", ota_partition->label, ota_partition->address, ota_partition->size);
      const char *table = CONFIG_PARTITION_TABLE_FILENAME;
      uint32_t size;
      esp_flash_get_size (NULL, &size);
      uint32_t secsize = 4096;  /* TODO */
      int expect = 4;
      if (strstr (table, "8m"))
         expect = 8;
      else if (strstr (table, "16m"))
         expect = 16;
      if (size == expect * 1024 * 1024)
      {
#ifdef  BUILD_ESP32_USING_CMAKE
         extern const uint8_t part_start[] asm ("_binary_partition_table_bin_start");
         extern const uint8_t part_end[] asm ("_binary_partition_table_bin_end");
#else
#error Use cmake
#endif
         /* Check and update partition table - expects some code to stay where it can run, i.e.0x10000, but may clear all settings */
         if ((part_end - part_start) > secsize)
            ESP_LOGE (TAG, "Block size error (%ld>%ld)", (long) (part_end - part_start), (long) secsize);
         else
         {
            uint8_t *mem = mallocspi (secsize);
            if (!mem)
               ESP_LOGE (TAG, "Malloc fail: %ld", (long) secsize);
            else
            {
               REVK_ERR_CHECK (esp_flash_read (NULL, mem, CONFIG_PARTITION_TABLE_OFFSET, secsize));
               if (memcmp (mem, part_start, part_end - part_start))
               {                // Different partition table
                  // Only update partition if we are running at an address that is valid in new partition table.
                  const uint8_t *p = part_start;
                  while (p < part_end)
                  {
                     if (p[0] == 0xAA && !strncmp ((char *) p + 12, "ota_", 4))
                     {
                        uint32_t a = (p[4] | (p[5] << 8) | (p[6] << 16) | (p[7] << 24));
                        if (a == ota_partition->address)
                           break;
                     }
                     p += 32;
                  }
                  if (p < part_end)
                  {
#ifndef CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED
#error Set CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED to allow CONFIG_REVK_PARTITION_CHECK
#endif
                     ESP_LOGE (TAG, "Updating partition table at %X", CONFIG_PARTITION_TABLE_OFFSET);
                     memset (mem, 0, secsize);
                     memcpy (mem, part_start, part_end - part_start);
                     REVK_ERR_CHECK (esp_flash_erase_region (NULL, CONFIG_PARTITION_TABLE_OFFSET, secsize));
                     REVK_ERR_CHECK (esp_flash_write (NULL, mem, CONFIG_PARTITION_TABLE_OFFSET, secsize));
                     esp_restart ();
                  } else
                     ESP_LOGE (TAG, "Not updating partition as no ota at %lX", ota_partition->address);
               } else
               {
                  ESP_LOGI (TAG, "Partition table at %X as expected (%s)", CONFIG_PARTITION_TABLE_OFFSET, table);
                  //ESP_LOG_BUFFER_HEX_LEVEL (TAG, part_start, part_end - part_start, ESP_LOG_INFO);
                  //ESP_LOGI (TAG, "Current partition");
                  //ESP_LOG_BUFFER_HEX_LEVEL (TAG, mem, secsize, ESP_LOG_INFO);
               }
               freez (mem);
            }
         }
      } else
         ESP_LOGE (TAG, "Flash partition not updated, size is unexpected: %ld (%s)", (long) size, table);
   }
#endif
   ESP_LOGI (TAG, "nvs_flash_init");
   nvs_flash_init ();
   ESP_LOGI (TAG, "nvs_flash_init_partition");
   nvs_flash_init_partition (TAG);
   ESP_LOGI (TAG, "nvs_open_from_partition");
   const esp_app_desc_t *app = esp_app_get_description ();
#ifndef	CONFIG_REVK_OLD_SETTINGS
   revk_settings_load (TAG, app->project_name);
#else
   if (nvs_open_from_partition (TAG, TAG, NVS_READWRITE, &revk_nvs))
   {
      ESP_LOGE (TAG, "No %s nvs partition", TAG);
      REVK_ERR_CHECK (nvs_open (TAG, NVS_READWRITE, &revk_nvs));
   }
   revk_register ("client", 0, 0, &clientkey, NULL, SETTING_SECRET);    // Parent
   revk_register ("prefix", 0, 0, &topiccommand, "command", SETTING_SECRET);    // Parent
   /* Fallback if no dedicated partition */
#define str(x) #x
#define s(n,d)		revk_register(#n,0,0,&n,d,0)
#define sp(n,d)		revk_register(#n,0,0,&n,d,SETTING_SECRET)
#define sa(n,a,d)	revk_register(#n,a,0,&n,d,0)
#define sap(n,a,d)	revk_register(#n,a,0,&n,d,SETTING_SECRET)
#define fh(n,a,s,d)	revk_register(#n,a,s,&n,d,SETTING_BINDATA|SETTING_HEX)
#define	u32(n,d)	revk_register(#n,0,4,&n,str(d),0)
#define	u16(n,d)	revk_register(#n,0,2,&n,str(d),0)
#define	u16a(n,a,d)	revk_register(#n,a,2,&n,str(d),0)
#define	i16(n)		revk_register(#n,0,2,&n,0,SETTING_SIGNED)
#define	u8a(n,a,d)	revk_register(#n,a,1,&n,str(d),0)
#define	u8(n,d)		revk_register(#n,0,1,&n,str(d),0)
#define	b(n,d)		revk_register(#n,0,1,&n,str(d),SETTING_BOOLEAN)
#define	s8(n,d)		revk_register(#n,0,1,&n,str(d),SETTING_SIGNED)
#define io(n,d)		revk_register(#n,0,sizeof(n),&n,"- "str(d),SETTING_SET|SETTING_BITFIELD|SETTING_FIX)
#define ioa(n,a,d)	revk_register(#n,a,sizeof(*n),&n,"- "str(d),SETTING_SET|SETTING_BITFIELD|SETTING_FIX)
#ifdef CONFIG_REVK_BLINK
#define led(n,a,d)	revk_register(#n,a,sizeof(*n),&n,"- "str(d),SETTING_SET|SETTING_BITFIELD|SETTING_FIX)
#else
#define led(n,a,d)
#endif
#define p(n)		revk_register("topic"#n,0,0,&topic##n,#n,0)
#define h(n,l,d)	revk_register(#n,0,l,&n,d,SETTING_BINDATA|SETTING_HEX)
#define hs(n,l,d)	revk_register(#n,0,l,&n,d,SETTING_BINDATA|SETTING_HEX|SETTING_SECRET)
#define bd(n,d)		revk_register(#n,0,0,&n,d,SETTING_BINDATA)
#define bad(n,a,d)	revk_register(#n,a,0,&n,d,SETTING_BINDATA)
#define bdp(n,d)	revk_register(#n,0,0,&n,d,SETTING_BINDATA|SETTING_SECRET)
   settings;
#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
   revk_register ("wifi", 0, 0, &wifissid, CONFIG_REVK_WIFISSID, SETTING_SECRET);       // Parent
   wifisettings;
#ifdef	CONFIG_REVK_MESH
   revk_register ("mesh", 0, 6, &meshid, CONFIG_REVK_MESHID, SETTING_BINDATA | SETTING_HEX | SETTING_SECRET);   // Parent
   meshsettings;
#else
#ifdef	CONFIG_REVK_WIFI
   revk_register ("ap", 0, 0, &apssid, CONFIG_REVK_APSSID, SETTING_SECRET);     // Parent
   apsettings;
#endif
#endif
#endif
#ifdef	CONFIG_REVK_MQTT
   revk_register ("mqtt", CONFIG_REVK_MQTT_CLIENTS, 0, &mqtthost, CONFIG_REVK_MQTTHOST, SETTING_SECRET);        // Parent
   mqttsettings;
#endif
#ifdef	CONFIG_REVK_APMODE
   apconfigsettings;
#endif
#undef s
#undef sa
#undef fh
#undef u32
#undef u16
#undef i16
#undef u8a
#undef u8
#undef b
#undef s8
#undef io
#undef ioa
#undef p
#undef str
#undef h
#undef hs
#undef bd
#undef bad
#undef bdp
   REVK_ERR_CHECK (nvs_open (app->project_name, NVS_READWRITE, &revk_nvs));
#endif
   if (watchdogtime)
   {                            /* Watchdog */
      compat_task_wdt_reconfigure (true, watchdogtime * 1000, true);
   }
   /* Application specific settings */
   if (!*appname)
      appname = strdup (app->project_name);
#ifdef	CONFIG_REVK_APMODE
   if (apgpio.set)
   {
      uint8_t p = apgpio.num;
      if (!(gpio_ok (p) & 2))
      {
         ESP_LOGE (TAG, "Not using GPIO %d", p);
         apgpio.set = 0;
      }
      revk_gpio_input (apgpio);
   }
#endif
   app_callback = app_callback_cb;
   revk_group = xEventGroupCreate ();
   xEventGroupSetBits (revk_group, GROUP_OFFLINE);
   {                            /* Chip ID from MAC */
      REVK_ERR_CHECK (esp_efuse_mac_get_default (revk_mac));
#ifdef	CONFIG_REVK_SHORT_ID
      revk_binid =
         ((revk_mac[0] << 16) + (revk_mac[1] << 8) + revk_mac[2]) ^ ((revk_mac[3] << 16) + (revk_mac[4] << 8) + revk_mac[5]);
      snprintf (revk_id, sizeof (revk_id), "%06llX", revk_binid);
#else
      revk_binid =
         ((uint64_t) revk_mac[0] << 40) + ((uint64_t) revk_mac[1] << 32) + ((uint64_t) revk_mac[2] << 24) +
         ((uint64_t) revk_mac[3] << 16) + ((uint64_t) revk_mac[4] << 8) + ((uint64_t) revk_mac[5]);
      snprintf (revk_id, sizeof (revk_id), "%012llX", revk_binid);
#endif
      if (!hostname || !*hostname)
         hostname = revk_id;    // default hostname (special case in settings)
   }
   revk_version = app->version;
   revk_app = appname;
   char *d = strstr (revk_version, "-dirty");
   if (d)
      asprintf ((char **) &revk_version, "%.*s+", d - revk_version, app->version);
   setenv ("TZ", tz, 1);
   tzset ();
}

void
revk_start (void)
{                               // Start stuff, init all done
#ifndef CONFIG_ENABLE_WIFI_STATION
   esp_netif_init ();
#endif
#ifndef	CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
   REVK_ERR_CHECK (esp_tls_set_global_ca_store (LECert, sizeof (LECert)));
#endif
#if     ESP_IDF_VERSION_MAJOR > 5 || ESP_IDF_VERSION_MAJOR == 5 && ESP_IDF_VERSION_MINOR > 0
   esp_sntp_setoperatingmode (SNTP_OPMODE_POLL);
   esp_sntp_setservername (0, ntphost);
#else
   sntp_setoperatingmode (SNTP_OPMODE_POLL);
   sntp_setservername (0, ntphost);
#endif
#ifdef	CONFIG_REVK_WIFI
   wifi_init ();
#endif
#ifdef	CONFIG_REVK_MESH
   mesh_init ();
#endif
   /* DHCP */
   char *id = NULL;
#ifdef	CONFIG_REVK_PREFIXAPP
   asprintf (&id, "%s-%s", appname, hostname);
#else
   asprintf (&id, "%s", hostname);
#endif
   if (sta_netif)
      esp_netif_set_hostname (sta_netif, id);
   freez (id);
#ifdef  CONFIG_REVK_APMODE
#ifndef	CONFIG_REVK_MATTER
#ifdef  CONFIG_MDNS_MAX_INTERFACES
   REVK_ERR_CHECK (mdns_init ());
   mdns_hostname_set (hostname);
   mdns_instance_name_set (appname);
#endif
#endif
#endif
#ifdef	CONFIG_REVK_WEB_DEFAULT
   revk_web_dummy (&webserver, 0);
#endif
   revk_task (TAG, task, NULL, 4);
}

TaskHandle_t
revk_task (const char *tag, TaskFunction_t t, const void *param, int kstack)
{                               /* General user task make */
   if (!kstack)
      kstack = 8;               // Default 8k
   TaskHandle_t task_id = NULL;
#ifdef	CONFIG_FREERTOS_UNICORE
   xTaskCreate (t, tag, kstack * 1024, (void *) param, 2, &task_id);    // Only one code anyway and not CPU1
#else
#ifdef CONFIG_REVK_LOCK_CPU1
   xTaskCreatePinnedToCore (t, tag, kstack * 1024, (void *) param, 2, &task_id, 1);
#else
   xTaskCreate (t, tag, kstack * 1024, (void *) param, 2, &task_id);
#endif
#endif
   if (!task_id)
      ESP_LOGE (TAG, "Task %s failed", tag);
   return task_id;
}

