revk/ESP32RevK/revk.c
#ifdef	CONFIG_REVK_MESH
void
mesh_make_mqtt (mesh_data_t * data, uint8_t tag, int tlen, const char *topic, int plen, const unsigned char *payload)
{
   // Tag is typically bit map of clients with bit 7 for retain when sending to root, and is client number when sending to leaf
   memset (data, 0, sizeof (*data));
   data->proto = MESH_PROTO_MQTT;
   if (plen < 0)
      plen = strlen ((char *) payload);
   if (tlen < 0)
      tlen = strlen (topic);
   data->size = 1 + tlen + 1 + plen;
   data->data = mallocspi (data->size + MESH_PAD);
   char *p = (char *) data->data;
   *p++ = tag;
   memcpy (p, topic, tlen);
   p += tlen;
   *p++ = 0;
   if (plen)
      memcpy (p, payload, plen);
   p += plen;
   ESP_LOGD (TAG, "Mesh Tx MQTT%02X %.*s %.*s", tag, tlen, topic, plen, payload);
}
#endif

#ifdef	CONFIG_REVK_MESH
void
revk_mesh_send_json (const mac_t mac, jo_t * jp)
{
   if (!jp)
      return;
   jo_t j = jo_pad (jp, MESH_PAD);      // Ensures MESH_PAD on end of JSON
   if (!j)
   {
      ESP_LOGE (TAG, "JO Pad failed");
      return;
   }
   const char *json = jo_rewind (j);
   if (json)
   {
      if (mac)
         ESP_LOGD (TAG, "Mesh Tx JSON %02X%02X%02X%02X%02X%02X: %s", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], json);
      else
         ESP_LOGD (TAG, "Mesh Tx JSON to root node: %s", json);
      mesh_data_t data = {.proto = MESH_PROTO_JSON,.data = (void *) json,.size = strlen (json) };
      mesh_encode_send ((void *) mac, &data, MESH_DATA_P2P);    // **** THIS EXPECTS MESH_PAD AVAILABLE EXTRA BYTES ON SIZE ****
   }
   jo_free (jp);
}
#endif

#ifdef	CONFIG_REVK_MQTT
const char *
revk_mqtt_out (uint8_t clients, int tlen, const char *topic, int plen, const unsigned char *payload, char retain)
{
   if (!clients)
      return NULL;
   if (link_down)
      return "Link down";
#ifdef	CONFIG_REVK_MESH
   if (esp_mesh_is_device_active () && !esp_mesh_is_root ())
   {                            // Send via mesh
      mesh_data_t data = {.proto = MESH_PROTO_MQTT };
      mesh_make_mqtt (&data, clients | (retain << 7), tlen, topic, plen, payload);      // Ensures MESH_PAD space one end
      mesh_encode_send (NULL, &data, 0);        // **** THIS EXPECTS MESH_PAD AVAILABLE EXTRA BYTES ON SIZE ****
      freez (data.data);
      return NULL;
   }
#endif
   const char *er = NULL;
   for (int client = 0; client < CONFIG_REVK_MQTT_CLIENTS && !er; client++)
      if (clients & (1 << client))
         er = lwmqtt_send_full (mqtt_client[client], tlen, topic, plen, payload, retain);
   return er;
}
#endif

const char *
revk_mqtt_send_raw (const char *topic, int retain, const char *payload, uint8_t clients)
{
   if (!payload)
      payload = "";
#ifdef	CONFIG_REVK_MQTT
   ESP_LOGD (TAG, "MQTT%02X publish %s (%s)", clients, topic ? : "-", payload);
   return revk_mqtt_out (clients, -1, topic, -1, (void *) payload, retain);
#else
   return "No MQTT";
#endif
}

const char *
revk_mqtt_send_str_clients (const char *str, int retain, uint8_t clients)
{
#ifdef	CONFIG_REVK_MQTT
   const char *e = str;
   while (*e && *e != ' ')
      e++;
   const char *p = e;
   if (*p)
      p++;
   ESP_LOGD (TAG, "MQTT%02X publish %.*s (%s)", clients, e - str, str, p);
   return revk_mqtt_out (clients, e - str, str, -1, (void *) p, retain);
#else
   return "No MQTT";
#endif
}

const char *
revk_mqtt_send_payload_clients (const char *prefix, int retain, const char *suffix, const char *payload, uint8_t clients)
{                               // Send to main, and N additional MQTT servers, or only to extra server N if copy -ve
#ifdef	CONFIG_REVK_MQTT
   char *topic = NULL;
   if (!prefix)
      topic = (char *) suffix;  /* Set fixed topic */
   else
      topic = revk_topic (prefix, NULL, suffix);
   if (!topic)
      return "No topic";
   const char *er = revk_mqtt_send_raw (topic, retain, payload, clients);
   if (topic != suffix)
      freez (topic);
   return er;
#else
   return "No MQTT";
#endif
}

const char *
revk_mqtt_send_clients (const char *prefix, int retain, const char *suffix, jo_t * jp, uint8_t clients)
{
   const char *err = NULL;
   if (b.disablewifi)
      return err;
   if (!jp)
      err = revk_mqtt_send_payload_clients (prefix, retain, suffix, NULL, clients);
   else
   {
      int pos = 0;
      err = jo_error (*jp, &pos);
      jo_rewind (*jp);
      if (err)
      {
         jo_free (jp);
         ESP_LOGE (TAG, "JSON error sending %s/%s (%s) at %d", prefix ? : "", suffix ? : "", err, pos);
      } else if (jo_here (*jp) == JO_STRING)
      {
         char *payload = NULL;
         int len = jo_strlen (*jp);
         if (len > 0)
         {
            payload = mallocspi (len + 1);
            jo_strncpy (*jp, payload, len + 1);
            err = revk_mqtt_send_payload_clients (prefix, retain, suffix, payload, clients);
         }
         jo_free (jp);
         free (payload);
      } else if (jo_isalloc (*jp))
      {
         char *payload = jo_finisha (jp);
         if (payload)
            err = revk_mqtt_send_payload_clients (prefix, retain, suffix, payload, clients);
         freez (payload);
      } else
      {                         // Static
         char *payload = jo_finish (jp);
         if (payload)
            err = revk_mqtt_send_payload_clients (prefix, retain, suffix, payload, clients);
      }
   }
   return err;
}

const char *
revk_state_clients (const char *suffix, jo_t * jp, uint8_t clients)
{                               // State message (retained)
   return revk_mqtt_send_clients (topicstate, 1, suffix, jp, clients);
}

const char *
revk_event_clients (const char *suffix, jo_t * jp, uint8_t clients)
{                               // Event message (may one day create log entries)
   return revk_mqtt_send_clients (topicevent, 0, suffix, jp, clients);
}

const char *
revk_error_clients (const char *suffix, jo_t * jp, uint8_t clients)
{                               // Error message, waits a while for connection if possible before sending
   if (*mqtthost[0])
      xEventGroupWaitBits (revk_group,
#ifdef	CONFIG_REVK_WIFI
                           GROUP_WIFI |
#endif
                           GROUP_MQTT, false, true, 20000 / portTICK_PERIOD_MS);
   return revk_mqtt_send_clients (topicerror, 0, suffix, jp, clients);
}

