revk/ESP32RevK/revk.c
const char *
revk_info_clients (const char *suffix, jo_t * jp, uint8_t clients)
{                               // Info message, nothing special
   return revk_mqtt_send_clients (topicinfo, 0, suffix, jp, clients);
}

const char *
revk_restart (int delay, const char *fmt, ...)
{
   char *reason = NULL;
   va_list ap;
   va_start (ap, fmt);
   vasprintf (&reason, fmt, ap);
   va_end (ap);
#ifdef	CONFIG_REVK_MESH
   if (delay >= 2 && !esp_mesh_is_root ())
      delay -= 2;               // For when lots of devices done at once, do root later
#endif
   if (restart_reason && !strcmp (restart_reason, reason))
      free (reason);
   else
   {
      free (restart_reason);
      restart_reason = reason;
      ESP_LOGE (TAG, "Restart %d %s", delay, reason);
   }
   if (delay < 0)
      restart_time = 0;         /* Cancelled */
   else
   {
      if (delay || !restart_time)
         restart_time = uptime () + delay;
      if (app_callback)
      {
         jo_t j = jo_create_alloc ();
         jo_string (j, NULL, reason);
         jo_int (j, "delay", delay);
         jo_rewind (j);
         app_callback (0, topiccommand, NULL, "restart", j);
         jo_free (&j);
      }
   }
   return "";                   /* Done */
}

#ifdef	CONFIG_REVK_APMODE
#if	CONFIG_HTTPD_MAX_REQ_HDR_LEN < 800
#warning You may want CONFIG_HTTPD_MAX_REQ_HDR_LEN larger, e.g. 800
#endif
#endif

// This function returns numbers of handlers, used by revk_web_settings_add() below
// Provides a convenient way for the app to configure max_uri_handlers
// !!! Update when adding/removing handlers below !!!
uint16_t
revk_num_web_handlers (void)
{
   return 5;
}

#if  defined(CONFIG_REVK_APCONFIG) || defined(CONFIG_REVK_WEB_DEFAULT)
void
revk_web_dummy (httpd_handle_t * webp, uint16_t port)
{                               // Just settings
   httpd_config_t config = HTTPD_DEFAULT_CONFIG ();
   config.lru_purge_enable = true;
   if (port)
      config.server_port = port;
   config.stack_size = 6 * 1024;        // Larger than default, just in case
   if (!httpd_start (webp, &config))
   {
      {
         httpd_uri_t uri = {
            .uri = "/",
            .method = HTTP_GET,
            .handler = revk_web_settings,
         };
         REVK_ERR_CHECK (httpd_register_uri_handler (*webp, &uri));
      }
      revk_web_settings_add (*webp);
   }
}
#endif

const char *
revk_web_safe (char **temp, const char *value)
{                               // Returns HTML safe version of value, allocated in *temp if needed (frees previous *temp)
   if (!temp || !value || !*value)
      return "";
   if (*temp)
   {
      free (*temp);
      *temp = NULL;
   }
   char *data = NULL;
   {
      int i = 0,
         o = 0;
      while (value[i])
      {
         if (value[i] == '\'' || value[i] == '"')
            o += 6;
         else if (value[i] == '&')
            o += 5;
         else if (value[i] == '<' || value[i] == '>')
            o += 4;
         else
            o++;
         i++;
      }
      if (i == o)
         return value;          // All OK
      data = mallocspi (o + 1);
   }
   if (!data)
      return "";
   char *o = data;
   while (*value)
   {
      if (*value == '&')
         o += sprintf (o, "&amp;");
      else if (*value == '\'')
         o += sprintf (o, "&apos;");
      else if (*value == '"')
         o += sprintf (o, "&quot;");
      else if (*value == '<')
         o += sprintf (o, "&lt;");
      else if (*value == '>')
         o += sprintf (o, "&gt;");
      else
         *o++ = *value;
      value++;
   }
   *o = 0;
   (*temp) = data;
   return data;
}

esp_err_t
revk_web_settings_add (httpd_handle_t webserver)
{
#ifdef	CONFIG_REVK_APDNS
   {
      httpd_uri_t uri = {
         .uri = "/hotspot-detect.html",
         .method = HTTP_GET,
         .handler = revk_web_settings,
      };
      REVK_ERR_CHECK (httpd_register_uri_handler (webserver, &uri));
   }
   {
      httpd_uri_t uri = {
         .uri = "/generate_204",
         .method = HTTP_GET,
         .handler = revk_web_settings,
      };
      REVK_ERR_CHECK (httpd_register_uri_handler (webserver, &uri));
   }
#endif
   {
      httpd_uri_t uri = {
         .uri = "/revk-status",
         .method = HTTP_GET,
         .handler = revk_web_status,
#ifdef	CONFIG_HTTPD_WS_SUPPORT
         .is_websocket = true,
#endif
      };
      REVK_ERR_CHECK (httpd_register_uri_handler (webserver, &uri));
   }
   {
      httpd_uri_t uri = {
         .uri = "/revk-settings",
         .method = HTTP_GET,
         .handler = revk_web_settings,
      };
      REVK_ERR_CHECK (httpd_register_uri_handler (webserver, &uri));
   }
   {
      httpd_uri_t uri = {
         .uri = "/revk-settings",
         .method = HTTP_POST,
         .handler = revk_web_settings,
      };
      REVK_ERR_CHECK (httpd_register_uri_handler (webserver, &uri));
   }
#ifdef  CONFIG_MDNS_MAX_INTERFACES
   mdns_service_add (NULL, "_http", "_tcp", 80, NULL, 0);
#endif
   return 0;
}

jo_t
revk_web_query (httpd_req_t * req)
{                               // get POST/GET form data as JSON
   jo_t j = NULL;
   char *query = NULL;
   if (req->method == HTTP_POST)
   {
      if (req->content_len <= 0)
         return NULL;
      if (req->content_len > 10000)
         return NULL;
      query = mallocspi (req->content_len + 1);
      if (!query)
         return NULL;
      int len = httpd_req_recv (req, query, req->content_len);
      if (len > 0)
      {
         query[len] = 0;
         j = jo_parse_query (query);
      }
   } else if (req->method == HTTP_GET)
   {
      int len = httpd_req_get_url_query_len (req);
      if (len <= 0)
         return NULL;
      query = mallocspi (len + 1);
      if (!query)
         return NULL;
      if (!httpd_req_get_url_query_str (req, query, len + 1))
      {
         query[len] = 0;
         j = jo_parse_query (query);
      }
   }
   free (query);
   return j;
}

void
revk_web_send (httpd_req_t * req, const char *format, ...)
{
   char *v = NULL;
   va_list ap;
   va_start (ap, format);
   ssize_t len = vasprintf (&v, format, ap);
   va_end (ap);
   if (v && *v && len > 0)
      httpd_resp_sendstr_chunk (req, v);
   free (v);
}

esp_err_t
revk_web_config_remove (httpd_handle_t webserver)
{
#ifdef	CONFIG_REVK_APDNS
   REVK_ERR_CHECK (httpd_unregister_uri_handler (webserver, "/hotspot-detect.html", HTTP_GET));
#endif
#ifdef	CONFIG_HTTPD_WS_SUPPORT
   REVK_ERR_CHECK (httpd_unregister_uri_handler (webserver, "/revk-status", HTTP_GET));
#endif
   REVK_ERR_CHECK (httpd_unregister_uri_handler (webserver, "/revk-settings", HTTP_GET));
   REVK_ERR_CHECK (httpd_unregister_uri_handler (webserver, "/revk-settings", HTTP_POST));
   return 0;
}

void
revk_web_head (httpd_req_t * req, const char *title)
{                               // Generic HTML heading
   char *qs = NULL;
   httpd_resp_set_type (req, "text/html;charset=utf-8");
   revk_web_send (req, "<meta name='viewport' content='width=device-width, initial-scale=.75'>" //
                  "<title>%s</title>"   //
                  "<style>"     //
                  "body{font-family:sans-serif;background:#8cf;background-image:linear-gradient(to right,#8cf,#48f);}"  //
                  "address,h1{white-space:nowrap;}"     //
                  "p.error{color:red;font-weight:bold;}"        //
                  "b.status{background:white;border:2px solid red;padding:3px;font-size:50%%;}" //
                  "input[type=submit],button{min-height:34px;min-width:64px;border-radius:30px;background-color:#ccc;border:1px solid gray;color:black;box-shadow:3px 3px 3px #0008;margin:3px;padding:3px 10px;font-size:100%%;}"      //
                  "tr.settingsdefault input,tr.settingsdefault textarea{background-color:#eef;}"        //
                  "input,textarea{margin:2px;border: 1px solid #ccc;}"  //
                  ".switch,.box{position:relative;display:inline-block;min-width:64px;min-height:34px;margin:3px;padding:2px 0 0 0px;}" //
                  ".switch input,.box input{opacity:0;width:0;height:0;}"       //
                  ".slider,.button{position:absolute;cursor:pointer;top:0;left:0;right:0;bottom:0;background-color:#ccc;-webkit-transition:.4s;transition:.4s;}"        //
                  ".slider:before{position:absolute;content:\"\";min-height:26px;min-width:26px;left:4px;bottom:3px;background-color:white;-webkit-transition:.4s;transition:.4s;}"     //
                  "input:checked+.slider,input:checked+.button{background-color:#12bd20;}"      //
                  "input:checked+.slider:before{-webkit-transform:translateX(30px);-ms-transform:translateX(30px);transform:translateX(30px);}" //
                  "span.slider:before{border-radius:50%%;}"     //
                  "span.slider,span.button{border-radius:34px;padding-top:8px;padding-left:10px;border:1px solid gray;box-shadow:3px 3px 3px #0008;}"   //
                  "</style>"    //
                  "<html><body" //
#ifndef CONFIG_HTTPD_WS_SUPPORT
                  " onLoad='handleLoad()'"
#endif
                  ">", revk_web_safe (&qs, title ? : appname));
   free (qs);
}

esp_err_t
revk_web_foot (httpd_req_t * req, uint8_t home, uint8_t wifi, const char *extra)
{                               // Generic html footing and return
   char *qs = NULL;
   revk_web_send (req, "<hr><address>");
   if (home)
      revk_web_send (req, "<a href=/>Home</a> ");
   if (wifi && !b.disablesettings)
      revk_web_send (req, "<a href=/revk-settings"      //
#ifdef  CONFIG_REVK_WEB_EXTRA
                     "?_page=0"
#endif
                     ">Settings</a> ");
   revk_web_send (req, appname);
   if (*revk_build_suffix)
      revk_web_send (req, "<small>%s</small>", revk_build_suffix);
   char temp[20];
   revk_web_send (req, ": %s %s", revk_version, revk_build_date (temp) ? : "?");
   if (extra && *extra)
      revk_web_send (req, " <b>%s</b>", revk_web_safe (&qs, extra));
   revk_web_send (req, "</address></body></html>");
   httpd_resp_sendstr_chunk (req, NULL);
   free (qs);
   return ESP_OK;
}

static const char *
get_status_text (void)
{
   if (restart_reason)
      return restart_reason;
   if (revk_link_down ())
      return *wifissid ? "WiFi not connected" : "WiFi not configured";
#ifdef  CONFIG_REVK_MQTT
   if (!revk_mqtt (0))
      return "WiFi connected, no MQTT";
   if (lwmqtt_failed (revk_mqtt (0)) < 0)
      return "MQTT failed";
   if (lwmqtt_failed (revk_mqtt (0)) > 5)
      return "MQTT not connecting";
   if (!lwmqtt_connected (revk_mqtt (0)))
      return "MQTT connecting";

   return "MQTT connected";
#else
   return "WiFI online";
#endif
}

#ifndef  CONFIG_REVK_OLD_SETTINGS
void
revk_web_setting_title (httpd_req_t * req, const char *fmt, ...)
{
   char *info = NULL;
   va_list ap;
   va_start (ap, fmt);
   vasprintf (&info, fmt, ap);
   va_end (ap);
   revk_web_send (req, "<tr><th align=left colspan=3>%s</th></tr>", info);
   free (info);
}
#endif

#ifndef  CONFIG_REVK_OLD_SETTINGS
void
revk_web_setting_info (httpd_req_t * req, const char *fmt, ...)
{
   char *info = NULL;
   va_list ap;
   va_start (ap, fmt);
   vasprintf (&info, fmt, ap);
   va_end (ap);
   revk_web_send (req, "<tr><td colspan=3>%s</th></tr>", info);
   free (info);
}
#endif

#ifndef  CONFIG_REVK_OLD_SETTINGS
void
revk_web_setting (httpd_req_t * req, const char *tag, const char *field)
{
   int index = 0;
   revk_settings_t *s = revk_settings_find (field, &index);
   if (!s)
   {
      ESP_LOGE (TAG, "Missing web setting %s", field);
      return;
   }
   int len = 0;
   char *qs = NULL;
   char *value = revk_settings_text (s, index, &len);
   if (!value)
      value = strdup ("");
   if (((s->hex || s->base32 || s->base64) && !(0
#ifdef  REVK_SETTINGS_HAS_SIGNED
                                                || s->type == REVK_SETTINGS_SIGNED
#endif
#ifdef  REVK_SETTINGS_HAS_UNSIGNED
                                                || s->type == REVK_SETTINGS_UNSIGNED
#endif
        )))
   {                            // Expand block to base coded
      const char *alphabet = s->base64 ? JO_BASE64 : s->base32 ? JO_BASE32 : JO_BASE16;
      uint8_t bits = s->base64 ? 6 : s->base32 ? 5 : 4;
      uint32_t dlen = (len * 8 + bits - 1) / bits + 1;
      dlen += (dlen / 40) + 1;  // Line breaks
      uint32_t dptr = 0;
      uint8_t *src = (uint8_t *) value;
      char *dst = malloc (dlen);
      unsigned int i = 0,
         b = 0,
         v = 0;
      while (i < len)
      {
         b += 8;
         v = (v << 8) + ((uint8_t *) src)[i++];
         while (b >= bits)
         {
            b -= bits;
            if ((dptr % 41) == 40)
               dst[dptr++] = '\n';
            dst[dptr++] = alphabet[(v >> b) & ((1 << bits) - 1)];
         }
      }
      if (b)
      {                         // final bits
         b += 8;
         v <<= 8;
         b -= bits;
         if ((dptr % 41) == 40)
            dst[dptr++] = '\n';
         dst[dptr++] = alphabet[(v >> b) & ((1 << bits) - 1)];
         while (b)
         {                      // padding
            while (b >= bits)
            {
               b -= bits;
               dst[dptr++] = '=';
            }
            if (b)
               b += 8;
         }
      }
      dst[dptr++] = 0;
      free (value);
      value = dst;
      len = dptr;
   }
   revk_web_send (req, "<tr%s>", revk_settings_set (s) ? "" : " class=settingsdefault");
   if (tag)
      revk_web_send (req, "<td>%s</td>", tag);
   else
      revk_web_send (req, "<td><tt><b>%.*s</b>%.*s<i>%s</i></tt></td>", s->dot, field, s->len - s->dot, field + s->dot,
                     field + s->len);
   const char *comment = "";
#ifdef	REVK_SETTINGS_HAS_COMMENT
   if (s->comment)
      comment = s->comment;
#endif
   const char *place = "";
#ifdef  REVK_SETTINGS_HAS_PLACE
   if (s->place)
      place = s->place;
#endif
   if (s->gpio && !*place)
      place = "Unused";
   if (s->ptr == &hostname)
      place = revk_id;          // Special case
#ifdef  REVK_SETTINGS_HAS_ENUM
   if (s->isenum)
   {
      revk_web_send (req, "<td nowrap><select name=\"_%s\" onchange=\"this.name='%s';settings.__%s.name='%s';\">", field, field,
                     field, field);
      const char *e = s->enums;
      int n = 0;
      int v = atoi (value);
      if (e)
         while (*e)
         {
            const char *p = e;
            while (*e && *e != ',')
               e++;
            revk_web_send (req, "<option value=\"%d\"%s>%.*s</option>", n, n == v ? " selected" : "", (int) (e - p), p);
            if (*e == ',')
               e++;
            n++;
         }
      revk_web_send (req, "</select></td><td>%s</td></tr>", comment);
      return;
   }
#endif
#ifdef  REVK_SETTINGS_HAS_BIT
   if (s->type == REVK_SETTINGS_BIT)
   {
      revk_web_send (req,
                     "<td nowrap><label class=switch><input type=checkbox id=\"%s\" name=\"_%s\" onchange=\"this.name='%s';settings.__%s.name='%s';\"%s><span class=slider></span></label></td><td><input type=hidden name=\"__%s\"><label for=\"%s\">%s</label></td></tr>",
                     field, field, field, field, field, *value == 't' ? " checked" : "", field, field, comment);
      free (value);
      return;
   }
#endif
   // Text input
#ifdef  REVK_SETTINGS_HAS_NUMERIC
   if (0
#ifdef  REVK_SETTINGS_HAS_SIGNED
       || s->type == REVK_SETTINGS_SIGNED
#endif
#ifdef  REVK_SETTINGS_HAS_UNSIGNED
       || s->type == REVK_SETTINGS_UNSIGNED
#endif
      )
   {                            // Numeric
      if (s->hex)
         revk_web_send (req,
                        "<td nowrap><input id=\"%s\" name=\"_%s\" onchange=\"this.name='%s';\" value=\"%s\" autocapitalize='off' autocomplete='off' spellcheck='false' autocorrect='off' placeholder=\"%s\" style=\"font-family:monospace\" size=%d maxlength=%d>%s</td><td>%s</td></tr>",
                        field, field, field, revk_web_safe (&qs, value), place, s->size * 2, s->size * 2, s->gpio ? " (GPIO)" :
#ifdef	REVK_SETTINGS_HAS_UNIT
                        s->unit ? :
#endif
                        "", comment);
      else
         revk_web_send (req,
                        "<td nowrap><input id=\"%s\" name=\"_%s\" onchange=\"this.name='%s';\" value=\"%s\" autocapitalize='off' autocomplete='off' spellcheck='false' autocorrect='off' placeholder=\"%s\" style=\"text-align:right\" size=10>%s</td><td>%s</td></tr>",
                        field, field, field, revk_web_safe (&qs, value), place, s->gpio ? " (GPIO)" :
#ifdef	REVK_SETTINGS_HAS_UNIT
                        s->unit ? :
#endif
                        "", comment);
   } else
#endif
#ifdef  REVK_SETTINGS_HAS_JSON
   if (s->type == REVK_SETTINGS_JSON)
      revk_web_send (req,
                     "<td nowrap><textarea cols=40 rows=4 id=\"%s\" name=\"_%s\" onchange=\"this.name='%s';\" autocapitalize='off' autocomplete='off' spellcheck='false' size=40 autocorrect='off' placeholder=\"%s\">%s</textarea></td><td>%s</td></tr>",
                     field, field, field, *place ? place : "JSON", revk_web_safe (&qs, value), comment);
   else
#endif
#if defined(REVK_SETTINGS_HAS_BLOB) || defined(REVK_SETTINGS_HAS_OCTET)
      if ((0
#ifdef REVK_SETTINGS_HAS_OCTET
           || (s->type == REVK_SETTINGS_OCTET && s->size > 32)
#endif
#ifdef REVK_SETTINGS_HAS_BLOB
           || s->type == REVK_SETTINGS_BLOB
#endif
          ) && (s->base64 || s->base32 || s->hex))
      revk_web_send (req,
                     "<td nowrap><textarea style=\"font-family:monospace\" cols=40 rows=4 id=\"%s\" name=\"_%s\" onchange=\"this.name='%s';\" autocapitalize='off' autocomplete='off' spellcheck='false' size=40 autocorrect='off' placeholder=\"%s\">%s</textarea></td><td>%s</td></tr>",
                     field, field, field, *place ? place : s->base64 ? "Base64" : s->base32 ? "Base32" : "Hex", revk_web_safe (&qs,
                                                                                                                               value),
                     comment);
   else
#endif
   if (s->type == REVK_SETTINGS_STRING || s->base64 || s->base32 || s->hex)
   {
      int w = s->size;
      if (w)
         w--;                   // Includes null
      if (s->hex)
         w *= 2;
      if (s->base32)
         w = (w * 8 + 4) / 5;
      if (s->base64)
         w = (w * 8 + 5) / 6;
      if (w)                    // Text (fixed)
         revk_web_send (req,
                        "<td nowrap><input %smaxlength=%d size=%d id=\"%s\" name=\"_%s\" onchange=\"this.name='%s';\" value=\"%s\" autocapitalize='off' autocomplete='off' spellcheck='false' size=40 autocorrect='off' placeholder=\"%s\"></td><td>%s</td></tr>",
                        (s->base64 || s->base32
                         || s->hex) ? "style=\"font-family:monospace\" " : "", w + 1, w < 20 ? w : 20, field, field, field,
                        revk_web_safe (&qs, value), place, comment);
      else                      // Text (variable)
         revk_web_send (req,
                        "<td nowrap><input id=\"%s\" name=\"_%s\" onchange=\"this.name='%s';\" value=\"%s\" autocapitalize='off' autocomplete='off' spellcheck='false' size=40 autocorrect='off' placeholder=\"%s\"></td><td>%s</td></tr>",
                        field, field, field, revk_web_safe (&qs, value), place, comment);
   }
   // Simple text input
   free (qs);
   free (value);
}

#define	revk_web_setting_s(req,prefix,field,value,place,suffix) revk_web_setting(req,prefix,field)
#else
void
revk_web_setting_s (httpd_req_t * req, const char *tag, const char *field, char *value, const char *place, const char *suffix)
{
   char *qs = NULL;
   revk_web_send (req,
                  "<tr><td>%s</td><td nowrap><input id='%s' name='%s' value='%s' autocapitalize='off' autocomplete='off' spellcheck='false' size=40 autocorrect='off' placeholder='%s'></td><td>%s</td></tr>",
                  tag ? : "", field, field, revk_web_safe (&qs, value), place ? : "", suffix ? : "");
   free (qs);
}
#endif

#ifndef  CONFIG_REVK_OLD_SETTINGS
extern revk_settings_t revk_settings[];
#endif

