revk/ESP32RevK/revk.c
esp_err_t
revk_web_settings (httpd_req_t * req)
{
   if (b.disablesettings)
      return ESP_OK;
   void hr (void)
   {
      revk_web_send (req, "<tr><td colspan=3><hr></td></tr>");
   }
   char *qs = NULL;
   revk_web_head (req, "Settings");
   revk_web_send (req, "<h1>%s <b id=_msg class=status>%s</b></h1>", revk_web_safe (&qs, hostname), get_status_text ());
   jo_t j = revk_web_query (req);
#ifdef  CONFIG_REVK_SETTINGS_PASSWORD
   uint8_t loggedin = 0;
#endif
   int8_t page = -1;            // Basic
   if (j)
   {
      const char *location = NULL;
      if (j && jo_find (j, "_page"))
      {
         char t[4] = "";
         jo_strncpy (j, t, sizeof (t));
         page = atoi (t);
      }
      if (jo_find (j, "_upgrade"))
      {
         const char *e = revk_settings_store (j, &location, REVK_SETTINGS_JSON_STRING); // Saved settings
         if (e && !*e && app_callback)
            app_callback (0, topiccommand, NULL, "setting", NULL);
         if (!e || !*e)
            e = revk_command ("upgrade", NULL);
         if (e && *e)
            revk_web_send (req, "<p class=error>%s</p>", e);
#ifdef  CONFIG_REVK_SETTINGS_PASSWORD
         else if (*password && jo_find (j, "password"))
            loggedin = 1;
#endif
      } else
      {
         wifi_mode_t mode = 0;
         esp_wifi_get_mode (&mode);
         char ok = 0;
         if (mode == WIFI_MODE_STA)
            ok = 1;             // We don't test wifi if in STA mode as it kills the page load, D'Oh
         else if (jo_find (j, "wifissid"))
         {                      // Test WiFi
            char ssid[33] = "";
            char pass[64] = "";
            strcpy (pass, wifipass);
            jo_strncpy (j, ssid, sizeof (ssid));
            if (!*ssid)
               revk_web_send (req, "No WiFi SSID. ");
            else
            {
               if (jo_find (j, "wifipass") == JO_STRING)
               {
                  jo_strncpy (j, pass, sizeof (pass));
#ifndef  CONFIG_REVK_OLD_SETTINGS
                  if (!strcmp (pass, revk_settings_secret))
                     strcpy (pass, wifipass);
#endif
               }
               if (!strcmp (ssid, wifissid) && !strcmp (pass, wifipass))
                  ok = 1;
               else if (sta_netif)
               {
                  esp_wifi_set_mode (mode == WIFI_MODE_STA ? WIFI_MODE_STA : WIFI_MODE_APSTA);
                  wifi_config_t cfg = { 0, };
                  cfg.sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
                  strncpy ((char *) cfg.sta.ssid, ssid, sizeof (cfg.sta.ssid));
                  strncpy ((char *) cfg.sta.password, pass, sizeof (cfg.sta.password));
                  esp_wifi_set_config (ESP_IF_WIFI_STA, &cfg);
                  xEventGroupClearBits (revk_group, GROUP_OFFLINE);
                  esp_wifi_connect ();
                  esp_netif_dhcpc_stop (sta_netif);
                  esp_netif_dhcpc_start (sta_netif);
                  int waiting = 10;
                  while (waiting--)
                  {
                     sleep (1);
                     esp_netif_ip_info_t ip;
                     if (!esp_netif_get_ip_info (sta_netif, &ip) && ip.ip.addr)
                     {
                        revk_web_send (req, "WiFi connected <b>" IPSTR "</b>.", IP2STR (&ip.ip));       // Attempts to allow copy to clipboard fail...
                        ok = 2;
                        break;
                     }
                  }
                  if (!ok)
                     revk_web_send (req, "WiFi did not connect, try again.");
               }
            }
         } else
            ok = 1;
         if (ok)
         {
            const char *e = revk_settings_store (j, &location, REVK_SETTINGS_JSON_STRING);
            if (e && !*e && app_callback)
               app_callback (0, topiccommand, NULL, "setting", NULL);
            if (e && *e)
            {
               if (location)
                  revk_web_send (req, "<p class=error>%s at <tt>%.40s</tt>%s</p>", e, location,
                                 strlen (location) > 40 ? "…" : "");
               else
                  revk_web_send (req, "<p class=error>%s</p>", e);
            }
#ifdef  CONFIG_REVK_SETTINGS_PASSWORD
            else if (*password && jo_find (j, "password"))
               loggedin = 1;
#endif
            if (!e && jo_find (j, "_save"))
               revk_web_send (req, "<script>document.location='/'</script>");
         }
      }
      jo_free (&j);
   }

   const char *shutdown = NULL;
   revk_shutting_down (&shutdown);
   revk_web_send (req,
                  "<form action='/revk-settings' name='settings' method='post' onsubmit=\"document.getElementById('_set').setAttribute('hidden','hidden');document.getElementById('_msg').textContent='Please wait';return true;\"><table>");
#ifdef  CONFIG_REVK_SETTINGS_PASSWORD
   if (*password && loggedin)
      revk_web_send (req, "<input name=password type=hidden value=\"%s\">", revk_web_safe (&qs, password));     // Logged in
   if (*password && !loggedin)
      revk_web_send (req, "<tr><td>Password</td><td colspan=2 nowrap><input name=password size=40 type=password autofocus> Not sent securely, so use with care on local network you control</td></tr>"  //
                     "<tr id=_set><td><input type=submit value='Login'></td></tr>");    // Ask for password
   else
#endif
   if (!shutdown)
   {
      revk_web_send (req, "<tr id=_set><td><input name=_save type=submit value='Save'></td><td colspan=2 nowrap>");
      if (revk_link_down ())
         page = -1;             // Basic settings to get on line
      else
      {
         void addpage (int8_t l, const char *v)
         {
            revk_web_send (req,
                           "<label class=box style=\"width:%dem\"><input type=radio name='_page' value='%d' onchange=\"document.settings.submit();\"%s><span class=button>%s</span></label>",
                           strlen (v), l, l == page ? " checked" : "", revk_web_safe (&qs, v));
         }
         addpage (-1, "Basic");
#ifdef	CONFIG_REVK_WEB_EXTRA
         addpage (0, appname);
         for (int p = 1; p <= CONFIG_REVK_WEB_EXTRA_PAGES; p++)
         {
            char temp[20];
            sprintf (temp, "%d", p);
            addpage (p, temp);
         }
#endif
#ifndef  CONFIG_REVK_OLD_SETTINGS
         for (revk_settings_t * s = revk_settings; s->len; s++)
            if (!s->hide && !s->revk)
            {
               addpage (-2, "Extra");
               break;
            }
         addpage (-3, "Library");
#endif
         if (!revk_link_down () && *otahost && page == -1)
            revk_web_send (req,
                           "</td><td id=_upgrade><input name=_upgrade type=submit value='Upgrade now from %s%s'>",
                           otahost, otabeta ? " (beta)" : "");
      }
      revk_web_send (req, "</td></tr>");
      if (
#ifdef  CONFIG_REVK_SETTINGS_PASSWORD
            *password ||
#endif
            !shutdown)
         hr ();
      switch (page)
      {
      case -1:                 // Basic
         if (!revk_link_down () && *otahost)
         {
#ifndef  CONFIG_REVK_OLD_SETTINGS
            if (otadays)
               revk_web_setting_s (req, "Auto upgrade", "otaauto", otaauto, NULL, "Automatic updates");
#ifdef	CONFIG_REVK_WEB_BETA
            revk_web_setting (req, "Beta software", "otabeta");
#endif
#endif
            hr ();
         }
         if (sta_netif)
         {
            revk_web_setting_s (req, "SSID", "wifissid", wifissid, "WiFi name", NULL);
            revk_web_setting_s (req, "Passphrase", "wifipass", wifipass, "WiFi pass", NULL);
            revk_web_setting_s (req, "Hostname", "hostname", hostname, NULL,
#ifdef  CONFIG_MDNS_MAX_INTERFACES
                                ".local"
#else
                                ""
#endif
               );
            if (!shutdown)
               revk_web_send (req, "<tr id=_found hidden><td>Found:</td><td colspan=2 id=_list></td></tr>");
            hr ();
         }
         revk_web_setting_s (req, "MQTT host", "mqtthost", mqtthost[0], "hostname", NULL);
         revk_web_setting_s (req, "MQTT user", "mqttuser", mqttuser[0], "username", NULL);
         revk_web_setting_s (req, "MQTT pass", "mqttpass", mqttpass[0], "password", NULL);
#ifdef  CONFIG_REVK_SETTINGS_PASSWORD
         hr ();
         revk_web_setting_s (req, "Password", "password", password, NULL,
                             "Settings password (not sent securely, so use with care on local network you control)");
#endif
#ifdef	CONFIG_REVK_WEB_TZ
         hr ();
         revk_web_setting_s (req, "Timezone", "tz", tz, "TZ code",
                             "See <a href ='https://gist.github.com/alwynallan/24d96091655391107939'>list</a>");
#endif
         break;
#ifdef	REVK_SETTINGS_HAS_COMMENT
#ifndef	CONFIG_REVK_OLD_SETTINGS
      case -2:                 // Extra
      case -3:                 // Library
         {
            revk_setting_group_t found = { 0 };
            int8_t line = -1;
            for (revk_settings_t * s = revk_settings; s->len; s++)
               if (!s->hide && s->revk == (page == -3 ? 1 : 0))
               {
                  void adda (revk_settings_t * s, int i)
                  {
                     char tag[32];
                     snprintf (tag, sizeof (tag), "%s%d", s->name, i + 1);
                     revk_web_setting (req, NULL, tag);
                  }
                  void add (revk_settings_t * s)
                  {
                     if (s->array)
                     {
                        if (!s->group)
                        {
                           if (line >= 0)
                              hr ();
                           line = 1;
                        }
                        for (int i = 0; i < s->array; i++)
                           adda (s, i);
                     } else
                     {
                        if (!s->group)
                        {
                           if (line > 0)
                              hr ();
                           line = 0;
                        }
                        revk_web_setting (req, NULL, s->name);  // TODO grouping... TODO arrays
                     }
                  }
                  if (s->group)
                  {
                     if (found[s->group / 8] & (1 << (s->group & 7)))
                        continue;
                     if (line >= 0)
                        hr ();
                     found[s->group / 8] |= (1 << (s->group & 7));
                     revk_settings_t *g = NULL;
                     if (s->array)
                        for (g = revk_settings; g->len; g++)
                           if (!g->hide && g->group == s->group && s->array != g->array)
                              break;
                     if (g && !g->len)
                        for (int i = 0; i < s->array; i++)
                        {
                           for (g = revk_settings; g->len; g++)
                              if (!g->hide && g->group == s->group)
                                 adda (g, i);
                     } else
                        for (g = revk_settings; g->len; g++)
                           if (!g->hide && g->group == s->group)
                              add (g);
                     line = 1;
                  } else
                     add (s);
               }
         }
         break;
#endif
#endif
#ifdef	CONFIG_REVK_WEB_EXTRA
      default:                 // App
         {
            extern void revk_web_extra (httpd_req_t *, int8_t);
            revk_web_extra (req, page);
         }
         break;
#endif
      }
      if (shutdown || page == -1)
         hr ();
   }
   revk_web_send (req, "</table></form>");
#ifdef CONFIG_HTTPD_WS_SUPPORT
   // A tad clunky, could be improved.
   revk_web_send (req, "<script>"       //
                  "var f=document.settings;"    //
                  "var reboot=0;"       //
                  "var ws = new WebSocket('ws://'+window.location.host+'/revk-status');ws.onopen=function(v){ws.send('%s');};"  //
                  "ws.onclose=function(v){ws=undefined;document.getElementById('_msg').textContent=(reboot?'Rebooting':'…');if(reboot)setTimeout(function(){location.reload();},3000);};"     //
                  "ws.onerror=function(v){ws.close();};"        //
                  "ws.onmessage=function(e){"   //
                  "o=JSON.parse(e.data);"       //
                  "if(typeof o === 'number')reboot=1;"  //
                  "else if(typeof o === 'string'){document.getElementById('_msg').textContent=o;setTimeout(function(){ws.send('');},1000);}"    //
                  "else if(Array.isArray(o))o.forEach(function(s){"     //
                  "b=document.createElement('button');" //
                  "b.onclick=function(e){"      //
                  "f._wifissid.name='wifissid';f.wifissid.value=s;"     //
                  "f._wifipass.name='wifipass';f.wifipass.value='';"    //
                  "f.wifipass.focus();" //
                  "return false;"       //
                  "};"          //
                  "b.textContent=s;"    //
                  "document.getElementById('_list').appendChild(b);"    //
                  "document.getElementById('_found').removeAttribute('hidden');"        //
                  "}); else if(typeof o == 'object'){"  //
                  "if(o.uptodate)document.getElementById('_upgrade').style.opacity=0.5;"        //
                  "};"          //
                  "};"          //
                  "</script>", page == -1 ? "scan" : "check");
#else
   revk_web_send (req, "<script>");
   if (shutdown && *shutdown)
   {
      revk_web_send (req, "function g(n){return document.getElementById(n);};"
                     "function s(n,v){var d=g(n);if(d)d.textContent=v;}" "function decode(rt)" "{" "if (rt == '')"
                     // Just reload the page in its initial state
                     "window.location.href = '/revk-settings';"
                     "else "
                     "s('_msg',rt);"
                     "}"
                     "function c()"
                     "{"
                     "xhttp = new XMLHttpRequest();"
                     "xhttp.onreadystatechange = function()"
                     "{"
                     "if (this.readyState == 4) {"
                     "if (this.status == 200)"
                     "decode(this.responseText);"
                     "}"
                     "};"
                     "xhttp.open('GET', '/revk-status', true);"
                     "xhttp.send();" "}" "function handleLoad(){window.setInterval(c, 1000);}");
   } else
   {
      // revk_web_head() always adds onLoad='handleLoad()'; this is the cheap way
      // to avoid adding more conditionals. Just emit a no-op.
      revk_web_send (req, "function handleLoad(){}");
   }
   httpd_resp_sendstr_chunk (req, "</script>");
#endif
   if (shutdown || page == -1)
   {                            // IP info
      revk_web_send (req, "<table>");
      int32_t up = uptime ();
      revk_web_send (req, "<tr><td>Uptime</td><td>%ld day%s %02ld:%02ld:%02ld</td></tr>", up / 86400,
                     up / 86400 == 1 ? "" : "s", up / 3600 % 24, up / 60 % 60, up % 60);
      {
         uint32_t heapspi = heap_caps_get_free_size (MALLOC_CAP_SPIRAM);
         uint32_t heap = esp_get_free_heap_size () - heapspi;
         if (heapspi)
            revk_web_send (req, "<tr><td>Free mem</td><td>%ld+%ld</td></tr>", heap, heapspi);
         else
            revk_web_send (req, "<tr><td>Free mem</td><td>%ld</td></tr>", heap);
      }
      {
         time_t now = time (0);
         if (now > 1000000000)
         {
            struct tm t;
            localtime_r (&now, &t);
            char temp[50];
            strftime (temp, sizeof (temp), "%F %T %Z", &t);
            revk_web_send (req, "<tr><td>Time</td><td>%s</td></tr>", temp);
         }
      }
      if (sta_netif)
      {
         {
            esp_netif_ip_info_t ip;
            if (!esp_netif_get_ip_info (sta_netif, &ip) && ip.ip.addr)
               revk_web_send (req, "<tr><td>IPv4</td><td>" IPSTR "</td></tr>"   //
                              "<tr><td>Gateway</td><td>" IPSTR "</td></tr>", IP2STR (&ip.ip), IP2STR (&ip.gw));
         }
#ifdef CONFIG_LWIP_IPV6
         {
            esp_ip6_addr_t ip;
            if (!esp_netif_get_ip6_global (sta_netif, &ip))
               revk_web_send (req, "<tr><td>IPv6</td><td>" IPV6STR "</td></tr>", IPV62STR (ip));
         }
#endif
         {
            void dns (esp_netif_dns_type_t t)
            {
               esp_netif_dns_info_t dns;
               if (!esp_netif_get_dns_info (sta_netif, t, &dns))
               {
                  if (dns.ip.type == ESP_IPADDR_TYPE_V4 && dns.ip.u_addr.ip4.addr)
                     revk_web_send (req, "<tr><td>DNS</td><td>" IPSTR "</td></tr>", IP2STR (&dns.ip.u_addr.ip4));
#ifdef CONFIG_LWIP_IPV6
                  else if (dns.ip.type == ESP_IPADDR_TYPE_V6)
                     revk_web_send (req, "<tr><td>DNS</td><td>" IPV6STR "</td></tr>", IP2STR (&dns.ip.u_addr.ip6));
#endif
               }
            }
            dns (ESP_NETIF_DNS_MAIN);
            dns (ESP_NETIF_DNS_BACKUP);
            dns (ESP_NETIF_DNS_FALLBACK);
         }
         wifi_ap_record_t ap = {
         };
         esp_wifi_sta_get_ap_info (&ap);
         revk_web_send (req, "<tr><td>SSID</td><td>%s</td></tr>", (char *) ap.ssid);
         revk_web_send (req, "<tr><td>BSSID</td><td>%02X%02X%02X%02X%02X%02X</td></tr>", (uint8_t) ap.bssid[0],
                        (uint8_t) ap.bssid[1], (uint8_t) ap.bssid[2], (uint8_t) ap.bssid[3], (uint8_t) ap.bssid[4],
                        (uint8_t) ap.bssid[5]);
         revk_web_send (req, "<tr><td>RSSI</td><td>%d</td></tr>", ap.rssi);
         revk_web_send (req, "<tr><td>Channel</td><td>%d</td></tr>", ap.primary);
         // TODO authmode
      }
      revk_web_send (req, "</table>");
   }
   free (qs);
   return revk_web_foot (req, 1, 0, NULL);
}

