revk/ESP32RevK/revk.c
#ifdef	CONFIG_HTTPD_WS_SUPPORT
esp_err_t
revk_web_status (httpd_req_t * req)
{
   wifi_mode_t mode = 0;
   esp_wifi_get_mode (&mode);
   int fd = httpd_req_to_sockfd (req);
   void wsend (jo_t * jp)
   {
      char *js = jo_finisha (jp);
      if (js)
      {
         httpd_ws_frame_t ws_pkt;
         memset (&ws_pkt, 0, sizeof (httpd_ws_frame_t));
         ws_pkt.payload = (uint8_t *) js;
         ws_pkt.len = strlen (js);
         ws_pkt.type = HTTPD_WS_TYPE_TEXT;
         httpd_ws_send_frame_async (req->handle, fd, &ws_pkt);
         free (js);
      }
   }
   void msg (const char *msg)
   {
      jo_t j = jo_create_alloc ();
      jo_string (j, NULL, msg);
      wsend (&j);
   }
   esp_err_t scan (void)
   {
      jo_t j = jo_create_alloc ();
      jo_array (j, NULL);
      if (sta_netif)
      {
         if (mode == WIFI_MODE_NULL)
            esp_wifi_set_mode (WIFI_MODE_STA);
         else if (mode == WIFI_MODE_AP)
            esp_wifi_set_mode (WIFI_MODE_APSTA);
         if (esp_wifi_scan_start (NULL, true) == ESP_ERR_WIFI_STATE)
         {
            esp_wifi_disconnect ();
            REVK_ERR_CHECK (esp_wifi_scan_start (NULL, true));
         }
         uint16_t ap_count = 0;
         static wifi_ap_record_t ap_info[32];   // Messy being static - should really have mutex
         memset (ap_info, 0, sizeof (ap_info));
         uint16_t number = sizeof (ap_info) / sizeof (*ap_info);
         REVK_ERR_CHECK (esp_wifi_scan_get_ap_records (&number, ap_info));
         REVK_ERR_CHECK (esp_wifi_scan_get_ap_num (&ap_count));
         int found = 0;
         for (int i = 0; (i < number) && (i < ap_count); i++)
         {
            int q;
            for (q = 0; q < i && strcmp ((char *) ap_info[i].ssid, (char *) ap_info[q].ssid); q++);
            if (q < i)
               continue;        // Duplicate
            jo_string (j, NULL, (char *) ap_info[i].ssid);
            found++;
         }
      }
      wsend (&j);
      if (sta_netif)
         esp_wifi_set_mode (mode);
      return ESP_OK;
   }
   esp_err_t status (void)
   {                            // Status message
      const char *r;
      int n = revk_shutting_down (&r);
      if (n)
      {
         jo_t j = jo_create_alloc ();
         jo_int (j, NULL, n);
         wsend (&j);
         if (ota_in_progress ())
         {
            jo_t j = jo_create_alloc ();
            jo_stringf (j, NULL, "%s %d%%", r, ota_percent);
            wsend (&j);
         } else
            msg (r);
      } else
         msg (get_status_text ());
      return ESP_OK;
   }
   if (req->method == HTTP_GET)
      return status ();
   // received packet
   httpd_ws_frame_t ws_pkt;
   memset (&ws_pkt, 0, sizeof (httpd_ws_frame_t));
   ws_pkt.type = HTTPD_WS_TYPE_TEXT;
   esp_err_t ret = httpd_ws_recv_frame (req, &ws_pkt, 0);
   if (ret)
      return ret;
   if (!ws_pkt.len)
      return status ();
   uint8_t *buf = calloc (1, ws_pkt.len + 1);
   if (!buf)
      return ESP_ERR_NO_MEM;
   ws_pkt.payload = buf;
   ret = httpd_ws_recv_frame (req, &ws_pkt, ws_pkt.len);
   if (ws_pkt.len == 4 && !memcmp (buf, "scan", 4))
   {                            // Basic settings
      if (!revk_link_down () && otaauto)
      {
         char *url = revk_upgrade_url ("", "bin");
         if (url)
         {
            int8_t check = revk_upgrade_check (url);
            jo_t j = jo_object_alloc ();
            jo_bool (j, "uptodate", !check);
            wsend (&j);
            free (url);
         }
      }
      if (!revk_shutting_down (NULL))
         scan ();
   }
   free (buf);
   return ESP_OK;
}
#else
#ifndef CONFIG_IDF_TARGET_ESP8266
#warning	You may want CONFIG_HTTPD_WS_SUPPORT
#endif
esp_err_t
revk_web_status (httpd_req_t * req)
{
   const char *shutdown = NULL;
   revk_shutting_down (&shutdown);
   if (shutdown && *shutdown)
   {
      if (ota_in_progress ())
         revk_web_send (req, "%s (%d%%)", shutdown, ota_percent);
      else
         httpd_resp_sendstr_chunk (req, shutdown);
   }
   httpd_resp_sendstr_chunk (req, NULL);
   return ESP_OK;
}
#endif // CONFIG_HTTPD_WS_SUPPORT

#ifdef	CONFIG_REVK_APDNS
static void
dummy_dns_task (void *pvParameters)
{
   int sock = socket (AF_INET, SOCK_DGRAM, IPPROTO_IP);
   if (sock >= 0)
   {
      int res = 1;
      setsockopt (sock, SOL_SOCKET, SO_REUSEADDR, &res, sizeof (res));
      {                         // Bind
         struct sockaddr_in dest_addr_ip4 = {.sin_addr.s_addr = htonl (INADDR_ANY),.sin_family = AF_INET,.sin_port = htons (53)
         };
         res = bind (sock, (struct sockaddr *) &dest_addr_ip4, sizeof (dest_addr_ip4));
      }
      if (!res)
      {
         ESP_LOGI (TAG, "Dummy DNS start");
         while (!dummy_dns_task_end)
         {                      // Process
            fd_set r;
            FD_ZERO (&r);
            FD_SET (sock, &r);
            struct timeval t = { 1, 0 };
            res = select (sock + 1, &r, NULL, NULL, &t);
            if (res < 0)
               break;
            if (!res)
               continue;
            uint8_t buf[1500];
            struct sockaddr_storage source_addr;
            socklen_t socklen = sizeof (source_addr);
            res = recvfrom (sock, buf, sizeof (buf) - 1, 0, (struct sockaddr *) &source_addr, &socklen);
            //ESP_LOG_BUFFER_HEX_LEVEL(TAG, buf, res, ESP_LOG_INFO);
            // Check this looks like a simple query, and answer A record
            if (res < 12)
               continue;        // Too short
            if (buf[2] & 0xFE)
               continue;        // Check simple QUERY
            if (buf[4] || buf[5] != 1 || buf[6] || buf[7] || buf[8] || buf[9])
               continue;        // Wrong counts
            int p = 12;         // Start of DNS
            while (p < res && buf[p])
               p += buf[p] + 1;
            p++;
            if (p + 4 > res)
               continue;        // Length issue
            if (buf[p] || buf[p + 1] != 1)
               continue;        // Not A record query
            p += 2;
            if (buf[p] || buf[p + 1] != 1)
               continue;        // Not IN class
            p += 2;
            // Let's answer
            buf[2] = 0x84;      // Response
            buf[3] = 0x00;
            buf[7] = 1;         // ANCOUNT=1
            buf[10] = 0;        // ARCOUNT=0
            buf[11] = 0;
            buf[p++] = 0xC0;
            buf[p++] = 12;      // Name from query
            buf[p++] = 0;
            buf[p++] = 1;       // A
            buf[p++] = 0;
            buf[p++] = 1;       // IN
            buf[p++] = 0;
            buf[p++] = 0;
            buf[p++] = 0;
            buf[p++] = 1;       // TTL 1
            buf[p++] = 0;
            buf[p++] = 4;       // Len 4
            buf[p++] = 10;
            buf[p++] = (uint8_t) (revk_binid >> 8);
            buf[p++] = (uint8_t) (revk_binid & 255);
            buf[p++] = 1;       // IP
            // Send reply
            sendto (sock, buf, p, 0, (struct sockaddr *) &source_addr, socklen);
            ESP_LOGI (TAG, "Dummy DNS reply (stack free %d)", uxTaskGetStackHighWaterMark (NULL));
         }
         ESP_LOGI (TAG, "Dummy DNS stop");
      } else
         ESP_LOGE (TAG, "Dummy DNS could not bind");
      close (sock);
   } else
      ESP_LOGE (TAG, "Dummy DNS no socket");
   vTaskDelete (NULL);
}
#endif

#ifdef	CONFIG_REVK_APMODE
static int
make_ap_name (void *ssid)
{                               // Sets AP name if in AP mode, returns length, ssid has to allow 32 characters
   if (!ssid)
      return 0;
   int l = 0;
   if (*apssid)
      l = snprintf (ssid, 32, "%s", apssid);
   else
#ifdef	CONFIG_REVK_APDNS
      l = snprintf (ssid, 32, "%s-%012llX", appname, revk_binid);
#else
      l = snprintf (ssid, 32, "%s-10.%d.%d.1", appname, (uint8_t) (revk_binid >> 8), (uint8_t) (revk_binid & 255));
#endif
   if (l > 32)
      l = 32;
   return l;
}

uint8_t
revk_wifi_is_ap (void *ssid)
{                               // Set SSID, and return length if in AP mode, else 0
   wifi_mode_t mode = 0;
   esp_wifi_get_mode (&mode);
   if (mode != WIFI_MODE_AP && mode != WIFI_MODE_APSTA)
      return 0;
   return make_ap_name (ssid);
}

static void
ap_start (void)
{
   if (!ap_netif)
      return;
   apstoptime = 0;
   if (*apssid)
      return;                   // We are running an AP mode configured, don't do special APMODE
   wifi_mode_t mode = 0;
   esp_wifi_get_mode (&mode);
   if (mode == WIFI_MODE_AP || mode == WIFI_MODE_APSTA)
      return;
   // WiFi
   wifi_config_t cfg = { 0, };
   cfg.ap.max_connection = 2;   // We expect only one really, this is for config
   cfg.ap.ssid_len = make_ap_name (cfg.ap.ssid);
   if (*appass)
   {
      int l;
      if ((l = strlen (appass)) > sizeof (cfg.ap.password))
         l = sizeof (cfg.ap.password);
      memcpy (&cfg.ap.password, appass, l);
      cfg.ap.authmode = WIFI_AUTH_WPA_WPA2_PSK;
   }
   ESP_LOGI (TAG, "AP%s config mode start %.*s", mode == WIFI_MODE_STA ? "STA" : "", cfg.ap.ssid_len, cfg.ap.ssid);
   // Make it go
   esp_wifi_set_mode (mode == WIFI_MODE_STA ? WIFI_MODE_APSTA : WIFI_MODE_AP);
   REVK_ERR_CHECK (esp_wifi_set_protocol (ESP_IF_WIFI_AP, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N));
   REVK_ERR_CHECK (esp_wifi_set_config (ESP_IF_WIFI_AP, &cfg));
   // DHCP
   esp_netif_ip_info_t info = {
      0,
   };
   IP4_ADDR (&info.ip, 10, revk_binid >> 8, revk_binid, 1);
   info.gw = info.ip;           /* We are the gateway */
   IP4_ADDR (&info.netmask, 255, 255, 255, 0);
   REVK_ERR_CHECK (esp_netif_dhcps_stop (ap_netif));
   REVK_ERR_CHECK (esp_netif_set_ip_info (ap_netif, &info));
   REVK_ERR_CHECK (esp_netif_dhcps_start (ap_netif));
#ifdef	CONFIG_REVK_APCONFIG
#ifndef	CONFIG_REVK_WEB_DEFAULT
   // Web server
   revk_web_dummy (&webserver, apport);
#endif
#endif
#ifdef	CONFIG_REVK_APDNS
   dummy_dns_task_end = 0;
   revk_task ("DNS", dummy_dns_task, NULL, 5);
#endif
}
#endif

#ifdef	CONFIG_REVK_APMODE
static void
ap_stop (void)
{
   if (!ap_netif)
      return;
   apstoptime = 0;
   if (*apssid)
      return;                   // We are running an AP mode configured, don't do special APMODE
   wifi_mode_t mode = 0;
   esp_wifi_get_mode (&mode);
   if (mode != WIFI_MODE_APSTA && mode != WIFI_MODE_AP)
      return;                   // Not in AP mode
   ESP_LOGI (TAG, "AP config mode stop");
   REVK_ERR_CHECK (esp_netif_dhcps_stop (ap_netif));
#ifdef  CONFIG_REVK_APCONFIG
#ifndef	CONFIG_REVK_WEB_DEFAULT
   if (webserver)
      httpd_stop (webserver);
   webserver = NULL;
#endif
#endif
#ifdef  CONFIG_WIFI_APDNS
   dummy_dns_task_end = 1;
#endif
   esp_wifi_set_mode (mode == WIFI_MODE_APSTA ? WIFI_MODE_STA : WIFI_MODE_NULL);
}
#endif

