revk/ESP32RevK/revk.c
int8_t
revk_ota_progress (void)
{                               // Progress (-2=up to date, -1=not, 0-100 is progress, 101=done)
   return ota_percent;
}

static void
ota_task (void *pvParameters)
{
   char *url = pvParameters;
   esp_http_client_config_t config = {
      .url = url,
      .timeout_ms = 30000,
   };
#ifndef	ESP_IDF_431             // Old version does not have
   /* Set the TLS in case redirect to TLS even if http */
   if (otacert->len)
   {
      config.cert_pem = (void *) otacert->data;
      config.cert_len = otacert->len;
   } else
#ifdef	CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
      config.crt_bundle_attach = esp_crt_bundle_attach;
#else
      config.use_global_ca_store = true;        /* Global cert */
#endif
   if (clientcert->len && clientkey->len)
   {
      config.client_cert_pem = (void *) clientcert->data;
      config.client_cert_len = clientcert->len;
      config.client_key_pem = (void *) clientkey->data;
      config.client_key_len = clientkey->len;
   }
#endif
   esp_http_client_handle_t client = esp_http_client_init (&config);
   if (!client)
   {
      jo_t j = jo_object_alloc ();
      jo_string (j, "description", "HTTP client failed");
      jo_string (j, "url", url);
      revk_error ("upgrade", &j);
   } else
   {
      int status = 0;
      int ota_size = 0;
      esp_err_t err = esp_http_client_open (client, 0);
      if (!err)
         ota_size = esp_http_client_fetch_headers (client);
      if (!err && ota_size && (status = esp_http_client_get_status_code (client)) / 100 == 2)
      {
         ESP_LOGI (TAG, "OTA %s", url);
#ifdef  CONFIG_REVK_MESH
         int ota_data = 0;
         int blockp = 0;
         uint8_t *block = mallocspi (MESH_MPS);
         if (block)
         {
            void send_ota (void)
            {
               mesh_data_t data = {.proto = MESH_PROTO_BIN,.size = blockp,.data = block };
               mesh_ota_ack = 0xA0 + (*block & 0x0F);   // The ACK we want
               mesh_safe_send (&mesh_ota_addr, &data, MESH_DATA_P2P, NULL, 0);
               int try = 10;
               while (!xSemaphoreTake (mesh_ota_sem, 500 / portTICK_PERIOD_MS) && --try)
                  mesh_safe_send (&mesh_ota_addr, &data, MESH_DATA_P2P, NULL, 0);       // Resend
               if (!try)
               {
                  ESP_LOGE (TAG, "Send timeout %02X", *data.data);
                  ota_size = 0;
               }
               blockp = 1;
               *block = 0xD0 + ((*block + 1) & 0xF);    // Next data block
            }
            blockp = 0;
            block[blockp++] = 0x50;     // Start[0]
            block[blockp++] = (ota_size >> 16);
            block[blockp++] = (ota_size >> 8);
            block[blockp++] = ota_size;
            send_ota ();
            sleep (5);          // Erase
            while (!err && ota_data < ota_size)
            {
               int len = esp_http_client_read_response (client, (char *) block + blockp, MESH_MPS - blockp);
               if (len <= 0)
                  break;
               blockp += len;
               send_ota ();
            }
            if (!err && ota_size)
            {                   // End
               if (blockp > 1)
                  send_ota ();  // Last data block
               blockp = 0;
               block[blockp++] = 0xE0 + (*block & 0xF); // End
               send_ota ();
            }
            free (block);
         }
#else
         esp_ota_handle_t ota_handle;
         const esp_partition_t *ota_partition = NULL;
         int ota_progress = 0;
         int ota_data = 0;
         uint32_t next = 0;
         uint32_t now = uptime ();
         if (!ota_partition)
            ota_partition = esp_ota_get_running_partition ();
         ota_partition = esp_ota_get_next_update_partition (ota_partition);
         if (!ota_partition)
         {
            jo_t j = jo_object_alloc ();
            jo_string (j, "description", "No OTA partition available");
            revk_error ("upgrade", &j);
            ota_size = 0;
            ota_percent = -3;
         } else
         {
            jo_t j = jo_make (NULL);
            jo_string (j, "partition", ota_partition->label);
            jo_stringf (j, "start", "%X", ota_partition->address);
            jo_int (j, "space", ota_partition->size);
            jo_int (j, "size", ota_size);
            revk_info ("upgrade", &j);
            if (!(err = REVK_ERR_CHECK (esp_ota_begin (ota_partition, ota_size, &ota_handle))))
               next = now + 5;
            char *buf = mallocspi (1024);
            if (buf)
               while (!err && ota_data < ota_size)
               {
                  int len = esp_http_client_read_response (client, (void *) buf, 1024);
                  if (len <= 0)
                     break;
                  if ((err = REVK_ERR_CHECK (esp_ota_write (ota_handle, buf, len))))
                     break;
                  if (!ota_data)
                     revk_restart (10, "OTA Download started");
                  else if (ota_data < ota_size / 2 && (ota_data + len) >= ota_size / 2)
                     revk_restart (10, "OTA Download progress");
                  ota_data += len;
                  now = uptime ();
                  ota_percent = ota_data * 100 / ota_size;
                  if (ota_percent != ota_progress && (ota_percent == 100 || next < now || ota_percent / 10 != ota_progress / 10))
                  {
                     ESP_LOGI (TAG, "Flash %d%%", ota_percent);
                     jo_t j = jo_make (NULL);
                     jo_int (j, "size", ota_size);
                     jo_int (j, "loaded", ota_data);
                     jo_int (j, "progress", ota_progress = ota_percent);
                     revk_info_clients ("upgrade", &j, -1);
                     next = now + 5;
                  }
               }
            free (buf);
            // End
            if (!err && !(err = REVK_ERR_CHECK (esp_ota_end (ota_handle))))
            {
               ota_percent = 101;
               jo_t j = jo_make (NULL);
               jo_int (j, "size", ota_size);
               jo_string (j, "complete", ota_partition->label);
               revk_info_clients ("upgrade", &j, -1);
               esp_ota_set_boot_partition (ota_partition);
               revk_restart (3, "OTA Download complete");
            } else
            {
               revk_restart (3, err == ESP_ERR_OTA_VALIDATE_FAILED ? "OTA Validation failed" : "OTA Failed");
               ota_percent = -4;
               if (err == ESP_ERR_OTA_VALIDATE_FAILED && otaauto && otadays && otadays < 30)
               {                // Force long recheck delay
                  jo_t j = jo_make (NULL);
                  if (otabeta)
                     jo_bool (j, "otabeta", 0);
                  else
                  {
                     jo_int (j, "otadays", 30);
                     jo_bool (j, "otastart", 0);
                  }
                  revk_setting (j);
                  jo_free (&j);
               }
            }
         }
#endif
      }
      REVK_ERR_CHECK (esp_http_client_cleanup (client));
      if (err || status / 100 != 2 || ota_size < 0)
         if (!err && status / 100 != 2)
         {
            jo_t j = jo_make (NULL);
            if (ota_size >= 0)
               jo_int (j, "size", ota_size);
            jo_string (j, "url", url);
            if (err)
            {
               jo_int (j, "code", err);
               jo_string (j, "description", esp_err_to_name (err));
            }
            if (status)
               jo_int (j, "status", status);
            revk_error ("upgrade", &j);
         }
   }
   freez (url);
   ota_task_id = NULL;
   ESP_LOGI (TAG, "OTA: Stack spare %d", uxTaskGetStackHighWaterMark (NULL));
   vTaskDelete (NULL);
}

static char *
revk_upgrade_url (const char *val, const char *ext)
{                               // OTA URL (malloc'd)
   char *url;                   // Passed to task
   if (!strncmp ((char *) val, "https://", 8) || !strncmp ((char *) val, "http://", 7))
      url = strdup (val);       // Whole URL provided (ignore beta)
   else if (*val == '/')
      asprintf (&url, "%s://%s%s",
#ifdef CONFIG_SECURE_SIGNED_ON_UPDATE
                otacert->len ? "https" : "http",
#else
                "http",         /* If not signed, use http as code should be signed and this uses way less memory  */
#endif
                otahost, val);  // Leaf provided (ignore beta)
   else
      asprintf (&url, "%s://%s/%s%s%s.%s?%s",
#ifdef CONFIG_SECURE_SIGNED_ON_UPDATE
                otacert->len ? "https" : "http",
#else
                "http",         /* If not signed, use http as code should be signed and this uses way less memory  */
#endif
                *val ? val : otahost, otabeta ? "beta/" : "", appname, revk_build_suffix, ext, revk_id);        // Hostname provided
   return url;
}

static int
revk_upgrade_check (const char *val)
{                               // Check if upgrade needed, -ve for error, 0 for no, +ve for yes
#ifdef CONFIG_IDF_TARGET_ESP8266
   // On ESP8266 we store version information in accompanying .desc file
   char *url = revk_upgrade_url (val, "desc");
#else
   // On ESP32 version information is stored in the .bin header
   char *url = revk_upgrade_url (val, "bin");
#endif
   jo_t j = jo_make (NULL);
   jo_string (j, "url", url);
   int ret = 0;
   esp_http_client_config_t config = {
      .url = url,
      .timeout_ms = 30000,
   };
   esp_http_client_handle_t client = esp_http_client_init (&config);
   if (!client)
      ret = -1;

   esp_app_desc_t data = { 0 };
   size_t size = 0;
   int status = 0;
#ifndef CONFIG_IDF_TARGET_ESP8266
   // On ESP32 esp_app_desc_t structure is located in the binary at offset 16
   // Size of the structure is 256 bytes; there's a static_assert in the SDK
   // in order to maintain that.
   if (!ret && esp_http_client_set_header (client, "Range", "bytes=32-287"))
      ret = -2;
#endif
   if (!ret && esp_http_client_open (client, 0))
      ret = -3;
   if (!ret && (size = esp_http_client_fetch_headers (client)) != sizeof (data))
   {
      ret = -4;
      jo_int (j, "size", size);
   }
   if (!ret && (status = esp_http_client_get_status_code (client) / 100 != 2))
   {
      ret = -5;
      jo_int (j, "status", status);
   }
   if (!ret && esp_http_client_read (client, (char *) &data, sizeof (data)) != sizeof (data))
      ret = -6;
   REVK_ERR_CHECK (esp_http_client_cleanup (client));
   if (data.magic_word != ESP_APP_DESC_MAGIC_WORD)
      ret = -7;
   if (!ret)
   {                            // Check version
      jo_stringf (j, "version", "%.32s", data.version);
      jo_stringf (j, "project", "%.32s", data.project_name);
      jo_stringf (j, "time", "%.16s", data.time);
      jo_stringf (j, "date", "%.16s", data.date);
      const esp_app_desc_t *app = esp_app_get_description ();
      if (strncmp (app->version, data.version, sizeof (data.version)))
      {
         ret = 1;               // Different version
         jo_string (j, "was-version", app->version);
      } else if (strncmp (app->project_name, data.project_name, sizeof (data.project_name)))
      {
         ret = 2;               // Different project name
         jo_string (j, "was-project", app->project_name);
      } else if (strncmp (app->date, data.date, sizeof (data.date)))
      {
         ret = 4;               // Different date
         jo_string (j, "was-date", app->date);
      } else if (strncmp (app->time, data.time, sizeof (data.time)))
      {
         ret = 4;               // Different time
         jo_string (j, "was-time", app->time);
      }
      if (!ret)
         jo_bool (j, "up-to-date", 1);
   } else
      jo_int (j, "fail", ret);
   revk_info ("upgrade", &j);
   free (url);
   return ret;
}

static const char *
revk_upgrade (const char *target, jo_t j)
{                               // Upgrade command
   if (ota_task_id)
      return "OTA running";
#ifdef CONFIG_REVK_MESH
   if (!esp_mesh_is_root ())
      return "";                // OK will be done by root and sent via MESH
#endif
   char val[256] = { 0 };
   if (j && jo_strncpy (j, val, sizeof (val)) < 0)
      *val = 0;
#ifdef CONFIG_REVK_MESH
   if (target && strlen (target) == 12)
   {
      ESP_LOGI (TAG, "Mesh relay upgrade %s %s", target, val);
      for (int n = 0; n < sizeof (mesh_ota_addr.addr); n++)
         mesh_ota_addr.addr[n] =
            (((target[n * 2] & 0xF) + (target[n * 2] > '9' ? 9 : 0)) << 4) + ((target[1 + n * 2] & 0xF) +
                                                                              (target[1 + n * 2] > '9' ? 9 : 0));
   } else if (target)
      return "Odd target";
   else
      memcpy (mesh_ota_addr.addr, revk_mac, 6); // Us
#endif
#ifdef CONFIG_REVK_MESH
   if (!target)                 // Us
#endif
   {                            // Upgrading this device (upgrade check only works for this device as comparing this device details)
      int8_t check = revk_upgrade_check (val);
      if (check <= 0)
      {
         ota_percent = check ? -3 : -2;
         return check ? "Upgrade check failed" : "Up to date";
      }
      ESP_LOGI (TAG, "Resetting watchdog");
      REVK_ERR_CHECK (compat_task_wdt_reconfigure (false, 120 * 1000, true));
      revk_restart (30, "OTA Download");        // Restart if download does not happen properly
#ifdef	CONFIG_NIMBLE_ENABLED
      ESP_LOGI (TAG, "Stopping any BLE");
      esp_bt_controller_disable ();     // Kill bluetooth during download
      esp_wifi_set_ps (WIFI_PS_NONE);   // Full wifi
#endif
   }
   char *url = revk_upgrade_url (val, "bin");
   ota_task_id = revk_task ("OTA", ota_task, url, 5);
   return "";
}

