revk/ESP32RevK/revk.c
const char *
revk_command (const char *tag, jo_t j)
{
   if (!tag || !*tag)
      return NULL;
   ESP_LOGD (TAG, "MQTT command [%s]", tag);
   const char *e = NULL;
   /* My commands */
   if (!e && !strcmp (tag, "upgrade"))
      e = revk_upgrade (NULL, j);       // Called internally maybe
   if (!e && !strcmp (tag, "status"))
   {
      up_next = 0;
      e = "";
   }
   if (!e && watchdogtime && !strcmp (tag, "watchdog"))
   {                            /* Test watchdog */
      b.wdt_test = 1;
      return "";
   }
   if (!e && !strcmp (tag, "restart"))
      e = revk_restart (3, "Restart command");
   if (!e && (!strcmp (tag, "factory") || !strcmp (tag, "fullfactory")))
   {
      char val[256];
      if (jo_strncpy (j, val, sizeof (val)) < 0)
         *val = 0;
      if (strncmp (val, revk_id, strlen (revk_id)))
         return "Bad ID";
      if (strcmp (val + strlen (revk_id), appname))
         return "Bad appname";
      const esp_app_desc_t *app = esp_app_get_description ();
      revk_settings_factory (TAG, app->project_name, tag[1] == 'u');
      revk_restart (3, "Factory reset");
      return "";
   }
#ifdef	CONFIG_REVK_MESH
   if (!e && !strcmp (tag, "mesh"))
   {                            // Update mesh if we are root
      // esp_mesh_switch_channel(const uint8_t *new_bssid, int csa_newchan, int csa_count)
   }
#endif
#ifdef	CONFIG_REVK_APMODE
   if (!e && !strcmp (tag, "apconfig"))
   {
      ap_start ();
      return "";
   }
   if (!e && !strcmp (tag, "apstop"))
   {
      ap_stop ();
      return "";
   }
#endif
#ifdef  CONFIG_FREERTOS_USE_TRACE_FACILITY
   if (!e && !strcmp (tag, "ps"))
   {                            // Process list
      TaskStatus_t *pxTaskStatusArray;
      volatile UBaseType_t uxArraySize,
        x;
      uint32_t ulTotalRunTime;
      // Take a snapshot of the number of tasks in case it changes while this
      // function is executing.
      uxArraySize = uxTaskGetNumberOfTasks ();
      // Allocate a TaskStatus_t structure for each task.  An array could be
      // allocated statically at compile time.
      pxTaskStatusArray = pvPortMalloc (uxArraySize * sizeof (TaskStatus_t));
      if (!pxTaskStatusArray)
         return "alloc fail";
      // Generate raw status information about each task.
      uxArraySize = uxTaskGetSystemState (pxTaskStatusArray, uxArraySize, &ulTotalRunTime);
      // For each populated position in the pxTaskStatusArray array,
      // format the raw data as human readable ASCII data
      for (x = 0; x < uxArraySize; x++)
      {
         jo_t j = jo_object_alloc ();
#ifdef	CONFIG_REVK_MESH
         jo_string (j, "node", nodename);
#endif
         jo_string (j, "task", pxTaskStatusArray[x].pcTaskName);
         jo_int (j, "priority", pxTaskStatusArray[x].uxCurrentPriority);
         jo_int (j, "free-stack", pxTaskStatusArray[x].usStackHighWaterMark);
         if (ulTotalRunTime)
            jo_int (j, "load", pxTaskStatusArray[x].ulRunTimeCounter * 100 / ulTotalRunTime);
         revk_info_clients ("ps", &j, -1);
      }
      vPortFree (pxTaskStatusArray);
      return "";
   }
#endif
   return e;
}

#if CONFIG_LOG_DEFAULT_LEVEL > 2
esp_err_t
revk_err_check (esp_err_t e, const char *file, int line, const char *func, const char *cmd)
{
   if (e != ERR_OK)
   {
      const char *fn = strrchr (file, '/');
      if (fn)
         fn++;
      else
         fn = file;
      ESP_LOGE (TAG, "Error %s at line %d in %s (%s)", esp_err_to_name (e), line, fn, cmd);
      jo_t j = jo_make (NULL);
      jo_int (j, "code", e);
      jo_string (j, "description", esp_err_to_name (e));
      jo_string (j, "file", fn);
      jo_int (j, "line", line);
      jo_string (j, "function", func);
      jo_string (j, "command", cmd);
      revk_error (NULL, &j);
   }
   return e;
}
#else
esp_err_t
revk_err_check (esp_err_t e)
{
   if (e != ERR_OK)
   {
      ESP_LOGE (TAG, "Error %s", esp_err_to_name (e));
      jo_t j = jo_make (NULL);
      jo_int (j, "code", e);
      jo_string (j, "description", esp_err_to_name (e));
      revk_error (NULL, &j);
   }
   return e;
}
#endif

#ifdef	CONFIG_REVK_MQTT
lwmqtt_t
revk_mqtt (int client)
{
   if (client >= CONFIG_REVK_MQTT_CLIENTS)
      return NULL;
   return mqtt_client[client];
}
#endif

#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
const char *
revk_wifi (void)
{
   return wifissid;
}
#endif

void
revk_blink (uint8_t on, uint8_t off, const char *colours)
{
   blink_on = on;
   blink_off = off;
   blink_colours = colours;
}

#ifdef	CONFIG_REVK_MQTT
void
revk_mqtt_close (const char *reason)
{
   for (int client = 0; client < CONFIG_REVK_MQTT_CLIENTS; client++)
      if (mqtt_client[client])
      {
         // Overwrite will
         jo_t j = jo_make (NULL);
         jo_bool (j, "up", 0);
         if (restart_time)
            jo_string (j, "reason", restart_reason);
         revk_state_clients (NULL, &j, 1 << client);
         lwmqtt_end (&mqtt_client[client]);
         ESP_LOGI (TAG, "MQTT%d Closed", client);
         xEventGroupWaitBits (revk_group, GROUP_MQTT_DOWN << client, false, true, 2 * 1000 / portTICK_PERIOD_MS);
      }
   ESP_LOGI (TAG, "MQTT Closed");
}
#endif

#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
void
revk_wifi_close (void)
{
   if (!sta_netif)
      return;
   wifi_mode_t mode = 0;
   esp_wifi_get_mode (&mode);
   if (mode == WIFI_MODE_NULL)
      return;
   ESP_LOGI (TAG, "WIFi Close");
   esp_wifi_deauth_sta (0);
#ifdef	CONFIG_REVK_MESH
   esp_mesh_stop ();
   esp_mesh_deinit ();
#endif
   dhcpc_stop ();
   esp_wifi_disconnect ();
   esp_wifi_set_mode (WIFI_MODE_NULL);
   esp_wifi_deinit ();
   esp_wifi_clear_fast_connect ();
   esp_wifi_stop ();
   ESP_LOGI (TAG, "WIFi Closed");
}
#endif

#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
int
revk_wait_wifi (int seconds)
{
   ESP_LOGD (TAG, "Wait WiFi %d", seconds);
   if (!*wifissid)
      return -1;
   return xEventGroupWaitBits (revk_group, GROUP_IP, false, true, seconds * 1000 / portTICK_PERIOD_MS) & GROUP_IP;
}
#endif

