revk/ESP32RevK/revk.c
#ifdef	CONFIG_REVK_MQTT
int
revk_wait_mqtt (int seconds)
{
   ESP_LOGD (TAG, "Wait MQTT %d", seconds);
   if (!*mqtthost[0])
      return -1;
   return xEventGroupWaitBits (revk_group, GROUP_MQTT, false, true, seconds * 1000 / portTICK_PERIOD_MS) & GROUP_MQTT;
}
#endif

#if	defined(CONFIG_REVK_WIFI) || defined(CONFIG_REVK_MESH)
uint32_t
revk_link_down (void)
{
   if (!link_down)
      return 0;
   return (uptime () - link_down) ? : 1;        // How long down;
}
#endif

uint32_t
revk_shutting_down (const char **reason)
{
   if (!restart_time)
   {
      if (reason)
         *reason = NULL;
      return 0;
   }
   int left = restart_time - uptime ();
   if (left <= 0)
      left = 1;
   if (reason)
      *reason = restart_reason;
   return left;
}

jo_t
jo_make (const char *node)
{
   jo_t j = jo_object_alloc ();
   time_t now = time (0);
   if (now > 1000000000)
      jo_datetime (j, "ts", now);
#ifdef	CONFIG_REVK_MESH
   if (node && *node)
      jo_string (j, "node", node);
   else if (!node && *nodename)
      jo_string (j, "node", nodename);
#endif
   return j;
}

const char *
revk_build_date (char d[20])
{
   if (!d)
      return NULL;
   const esp_app_desc_t *app = esp_app_get_description ();
   if (!app)
      return NULL;
   const char *v = app->date;
   if (!v || strlen (v) != 11)
      return NULL;
   snprintf (d, 20, "%.4s-xx-%.2sT%.8s", v + 7, v + 4, app->time);
   const char mname[] = "JanFebMarAprMayJunJulAugSepOctNovDec";
   for (int m = 0; m < 12; m++)
      if (!strncmp (mname + m * 3, v, 3))
      {
         d[5] = '0' + (m + 1) / 10;
         d[6] = '0' + (m + 1) % 10;
         break;
      }
   if (d[8] == ' ')
      d[8] = '0';
   return d;
}

#ifdef	CONFIG_REVK_SEASON
const char *
revk_season (time_t now)
{                               // Return a characters for seasonal variation, E=Easter, Y=NewYear, X=Christmas, H=Halloween, V=Valentines, F=Full Moon, N=New moon
   static char temp[8];         // Non re-entrant
   char *p = temp;
   struct tm t;
   localtime_r (&now, &t);
   if (t.tm_year >= 100)
   {
#ifdef	CONFIG_REVK_LUNAR
      if (now < revk_moon_full_last (now) + 12 * 3600 || now > revk_moon_full_next (now) - 12 * 3600)
         *p++ = 'M';
      if (now < revk_moon_new (now) + 12 * 3600 && now > revk_moon_new (now) - 12 * 3600)
         *p++ = 'N';
#endif
      if (t.tm_mon == 1 && t.tm_mday == 14)
         *p++ = 'V';
      if (t.tm_mon == 11 && t.tm_mday <= 25)
         *p++ = 'X';
      if (t.tm_mon == 0 && t.tm_mday <= 7)
         *p++ = 'Y';
      if (t.tm_mon == 9 && t.tm_mday == 31 && t.tm_hour >= 16)
         *p++ = 'H';
      const uint8_t ed[] = { 114, 103, 23, 111, 31, 118, 108, 28, 116, 105, 25, 113, 102, 22, 110, 30,
         117, 107, 27
      };
      {
       struct tm e = { tm_hour:12 };
         int m = ed[(t.tm_year + 1900) % 19];
         e.tm_year = t.tm_year;
         e.tm_mon = 2 + m / 100;
         e.tm_mday = m % 100;
         mktime (&e);
         int gf = e.tm_yday + (7 - e.tm_wday) - 2;      // good Friday;
         if (t.tm_yday >= gf && t.tm_yday <= gf + 3)
            *p++ = 'E';
      }
   }
   *p = 0;
   if (p > temp + 1)
   {                            // Swap first in list based on hour
      int l = t.tm_hour % (p - temp);
      if (l)
      {
         char c = *temp;
         *temp = temp[l];
         temp[l] = c;
      }
   }
   return temp;
}
#endif

#ifdef	CONFIG_REVK_SOLAR

#define DEGS_PER_RAD             (180 / M_PI)
#define SECS_PER_DAY             86400

#define MEAN_ANOMOLY_C           6.24005822136
#define MEAN_ANOMOLY_K           0.01720196999
#define MEAN_LONGITUDE_C         4.89493296685
#define MEAN_LONGITUDE_K         0.01720279169
#define LAMBDA_K1                0.03342305517
#define LAMBDA_K2                0.00034906585
#define MEAN_OBLIQUITY_C         0.40908772337
#define MEAN_OBLIQUITY_K         -6.28318530718e-09

#define MAX_ERROR                0.0000001

time_t
sun_rise (int y, int m, int d, double latitude, double longitude, double sun_altitude)
{
 struct tm tm = { tm_mon: m - 1, tm_year: y - 1900, tm_mday: d, tm_hour:6 - longitude / 15 };
   return sun_find_crossing (mktime (&tm), latitude, longitude, sun_altitude);
}

time_t
sun_set (int y, int m, int d, double latitude, double longitude, double sun_altitude)
{
 struct tm tm = { tm_mon: m - 1, tm_year: y - 1900, tm_mday: d, tm_hour:18 - longitude / 15 };
   return sun_find_crossing (mktime (&tm), latitude, longitude, sun_altitude);
}

  /***************************************************************************/
   // Finds the nearest time to start_time when sun angle is wanted_altitude (degrees)

time_t
sun_find_crossing (time_t start_time, double latitude, double longitude, double wanted_altitude)
{
   double t,
     last_t,
     new_t,
     altitude,
     last_altitude,
     error;
   time_t result;

   last_t = (double) start_time;
   sun_position (last_t, latitude, longitude, &last_altitude, NULL);
   t = last_t + 1;
   do
   {
      sun_position (t, latitude, longitude, &altitude, NULL);
      error = altitude - wanted_altitude;
      result = (time_t) (0.5 + t);

      new_t = t - error * (t - last_t) / (altitude - last_altitude);
      last_t = t;
      last_altitude = altitude;
      t = new_t;
   }
   while (fabs (error) > MAX_ERROR);

   return result;
}

void
sun_position (double t, double latitude, double longitude, double *altitudep, double *azimuthp)
{
   struct tm tm;
   time_t j2000_epoch;

   double latitude_offset;      // Site latitude offset angle (NORTH = +ve)
   double longitude_offset;     // Site longitude offset angle (EAST = +ve)
   double j2000_days;           // Time/date from J2000.0 epoch (Noon on 1/1/2000)
   double clock_angle;          // Clock time as an angle
   double mean_anomoly;         // Mean anomoly angle
   double mean_longitude;       // Mean longitude angle
   double lambda;               // Apparent longitude angle (lambda)
   double mean_obliquity;       // Mean obliquity angle
   double right_ascension;      // Right ascension angle
   double declination;          // Declination angle
   double eqt;                  // Equation of time angle
   double hour_angle;           // Hour angle (noon = 0, +ve = afternoon)
   double altitude;
   double azimuth;

