revk/ESP32RevK/revk.c
   latitude_offset = latitude / DEGS_PER_RAD;
   longitude_offset = longitude / DEGS_PER_RAD;

   //   printf("lat %lf, long %lf\n", latitude_offset * DEGS_PER_RAD, longitude_offset * DEGS_PER_RAD);

   // Calculate clock angle based on UTC unixtime of user supplied time
   clock_angle = 2 * M_PI * fmod (t, SECS_PER_DAY) / SECS_PER_DAY;

   // Convert localtime 'J2000.0 epoch' (noon on 1/1/2000) to unixtime
   tm.tm_sec = 0;
   tm.tm_min = 0;
   tm.tm_hour = 12;
   tm.tm_mday = 1;
   tm.tm_mon = 0;
   tm.tm_year = 100;
   tm.tm_wday = tm.tm_yday = tm.tm_isdst = 0;
   j2000_epoch = mktime (&tm);

   j2000_days = (double) (t - j2000_epoch) / SECS_PER_DAY;

   // Calculate mean anomoly angle (g)
   // [1] g = g_c + g_k * j2000_days
   mean_anomoly = MEAN_ANOMOLY_C + MEAN_ANOMOLY_K * j2000_days;

   // Calculate mean longitude angle (q)
   // [1] q = q_c + q_k * j2000_days
   mean_longitude = MEAN_LONGITUDE_C + MEAN_LONGITUDE_K * j2000_days;

   // Calculate apparent longitude angle (lambda)
   // [1] lambda = q + l_k1 * sin(g) + l_k2 * sin(2 * g)
   lambda = mean_longitude + LAMBDA_K1 * sin (mean_anomoly) + LAMBDA_K2 * sin (2 * mean_anomoly);

   // Calculate mean obliquity angle (e)     No trim - always ~23.5deg
   // [1] e = e_c + e_k * j2000_days
   mean_obliquity = MEAN_OBLIQUITY_C + MEAN_OBLIQUITY_K * j2000_days;

   // Calculate right ascension angle (RA)   No trim - atan2 does trimming
   // [1] RA = atan2(cos(e) * sin(lambda), cos(lambda))
   right_ascension = atan2 (cos (mean_obliquity) * sin (lambda), cos (lambda));

   // Calculate declination angle (d)        No trim - asin does trimming
   // [1] d = asin(sin(e) * sin(lambda))
   declination = asin (sin (mean_obliquity) * sin (lambda));

   // Calculate equation of time angle (eqt)
   // [1] eqt = q - RA
   eqt = mean_longitude - right_ascension;
   // Calculate sun hour angle (h)
   // h = clock_angle + long_o + eqt - PI
   hour_angle = clock_angle + longitude_offset + eqt - M_PI;

   // Calculate sun altitude angle
   // [2] alt = asin(cos(lat_o) * cos(d) * cos(h) + sin(lat_o) * sin(d))
   altitude =
      DEGS_PER_RAD * asin (cos (latitude_offset) * cos (declination) * cos (hour_angle) +
                           sin (latitude_offset) * sin (declination));

   // Calculate sun azimuth angle
   // [2] az = atan2(sin(h), cos(h) * sin(lat_o) - tan(d) * cos(lat_o))
   azimuth =
      DEGS_PER_RAD * atan2 (sin (hour_angle), cos (hour_angle) * sin (latitude_offset) - tan (declination) * cos (latitude_offset));

   if (altitudep)
      *altitudep = altitude;
   if (azimuthp)
      *azimuthp = azimuth;
}


#endif

#ifdef	CONFIG_REVK_LUNAR

#define PI      3.1415926535897932384626433832795029L
#define sinld(a)        sinl(PI*(a)/180.0L)

static time_t
moontime (int cycle, float phase)
{                               // report moon time for specific lunar cycle and phase
   long double k = phase + cycle;
   long double T = k / 1236.85L;
   long double T2 = T * T;
   long double T3 = T2 * T;
   long double JD =
      2415020.75933L + 29.53058868L * k + 0.0001178L * T2 - 0.000000155L * T3 + 0.00033L * sinld (166.56L + 132.87L * T -
                                                                                                  0.009173L * T2);
   long double M = 359.2242L + 29.10535608L * k - 0.0000333L * T2 - 0.00000347L * T3;
   long double M1 = 306.0253L + 385.81691806L * k + 0.0107306L * T2 + 0.00001236L * T3;
   long double F = 21.2964L + 390.67050646L * k - 0.0016528L * T2 - 0.00000239L * T3;
   long double A = (0.1734 - 0.000393 * T) * sinld (M)  //
      + 0.0021 * sinld (2 * M)  //
      - 0.4068 * sinld (M1)     //
      + 0.0161 * sinld (2 * M1) //
      - 0.0004 * sinld (3 * M1) //
      + 0.0104 * sinld (2 * F)  //
      - 0.0051 * sinld (M + M1) //
      - 0.0074 * sinld (M - M1) //
      + 0.0004 * sinld (2 * F + M)      //
      - 0.0004 * sinld (2 * F - M)      //
      - 0.0006 * sinld (2 * F + M1)     //
      + 0.0010 * sinld (2 * F - M1)     //
      + 0.0005 * sinld (M + 2 * M1);    //
   JD += A;
   return (JD - 2440587.5L) * 86400LL;
}

static time_t moonlast = 0,
   moonnew = 0,
   moonnext = 0;
static void
getmoons (time_t t)
{
   if (t >= moonlast && t < moonnext)
      return;
   int cycle = ((long double) t + 2207726238UL) / 2551442.86195200L;    // Guess
   time_t f1 = moontime (cycle, 0.5);
   if (t < f1)
   {
      moonlast = moontime (cycle - 1, 0.5);
      moonnew = moontime (cycle, 0);
      moonnext = f1;
      return;
   }
   time_t f2 = moontime (cycle + 1, 0.5);
   if (t >= f2)
   {
      moonlast = f2;
      moonnew = moontime (cycle + 2, 0);
      moonnext = moontime (cycle + 2, 0.5);
   }
   moonlast = f1;
   moonnew = moontime (cycle + 1, 0);
   moonnext = f2;
}

time_t
revk_moon_full_last (time_t t)
{                               // Last full moon (<=t)
   getmoons (t);
   return moonlast;
}

time_t
revk_moon_new (time_t t)
{                               // Current new moon (may be >t or <=t)
   getmoons (t);
   return moonnew;
}

time_t
revk_moon_full_next (time_t t)
{                               // Next full moon (<t)
   getmoons (t);
   return moonnext;
}

#endif

uint8_t
revk_has_ip (void)
{
   return gotip;
}

uint8_t
revk_has_ipv4 (void)
{
   return gotip & 0x80;
}

uint8_t
revk_has_ipv6 (void)
{
   return gotip & 0x7E;         // bit 0 is link local
}

void
revk_enable_wifi (void)
{
   if (b.disablewifi)
   {
#ifdef	CONFIG_REVK_WIFI
      wifi_init ();
#endif
#ifdef	CONFIG_REVK_MQTT
      revk_mqtt_init ();
#endif
      b.disablewifi = 0;
   }
}

void
revk_disable_upgrade (void)
{
   b.disableupgrade = 1;
}

void
revk_enable_upgrade (void)
{
   b.disableupgrade = 0;
}

void
revk_disable_wifi (void)
{
   if (!b.disablewifi)
   {
#ifdef	CONFIG_REVK_MQTT
      revk_mqtt_close ("disabled");
#endif
#ifdef	CONFIG_REVK_WIFI
      revk_wifi_close ();
#endif
      b.disablewifi = 1;
   }
}

void
revk_enable_ap (void)
{
   b.disableap = 0;
}

void
revk_disable_ap (void)
{
   b.disableap = 1;
}

void
revk_enable_settings (void)
{
   b.disablesettings = 0;
}

void
revk_disable_settings (void)
{
   b.disablesettings = 1;
}

#ifdef  REVK_SETTINGS_HAS_GPIO
esp_err_t
revk_gpio_output (revk_gpio_t g, uint8_t o)
{                               // Make pin output, and set level, return 0 if OK
   esp_err_t e = 0;
   if (!g.set || !GPIO_IS_VALID_OUTPUT_GPIO (g.num))
      e = ESP_FAIL;
#ifndef	CONFIG_IDF_TARGET_ESP32C3
   if (!e && rtc_gpio_is_valid_gpio (g.num))
      e = rtc_gpio_deinit (g.num);
#endif
   if (!e)
      e = gpio_reset_pin (g.num);
   if (!e)
      e = gpio_set_level (g.num, (o ? 1 : 0) ^ g.invert);
#ifndef  CONFIG_REVK_OLD_SETTINGS
   if (!e)
      e = gpio_set_direction (g.num, g.pulldown ? GPIO_MODE_OUTPUT_OD : GPIO_MODE_OUTPUT);
   if (!e)
      e = gpio_set_drive_capability (g.num, 2 + g.strong - g.weak * 2);
#ifndef	CONFIG_IDF_TARGET_ESP32C3
   if (!e && rtc_gpio_is_valid_gpio (g.num))
   {
      if (!e)
         e = rtc_gpio_set_direction (g.num, g.pulldown ? RTC_GPIO_MODE_OUTPUT_OD : RTC_GPIO_MODE_OUTPUT_ONLY);
      if (!e)
         e = rtc_gpio_set_drive_capability (g.num, 2 + g.strong - g.weak * 2);
   }
#endif
#else
   if (!e)
      e = gpio_set_direction (g.num, GPIO_MODE_OUTPUT);
#endif
   return e;
}

esp_err_t
revk_gpio_set (revk_gpio_t g, uint8_t o)
{
   if (!g.set || !GPIO_IS_VALID_OUTPUT_GPIO (g.num))
      return ESP_FAIL;
   return gpio_set_level (g.num, (o ? 1 : 0) ^ g.invert);
}

esp_err_t
revk_gpio_input (revk_gpio_t g)
{
   esp_err_t e = 0;
   if (!g.set || !GPIO_IS_VALID_GPIO (g.num))
      e = ESP_FAIL;
#ifndef	CONFIG_IDF_TARGET_ESP32C3
   if (!e && rtc_gpio_is_valid_gpio (g.num))
      e = rtc_gpio_deinit (g.num);
#endif
   if (!e)
      e = gpio_reset_pin (g.num);
   if (!e)
      e = gpio_set_direction (g.num, GPIO_MODE_INPUT);
#ifndef  CONFIG_REVK_OLD_SETTINGS
   if (!g.pulldown && !g.nopull)
   {
      if (!e)
         e = gpio_pullup_en (g.num);
   } else
   {
      if (!e)
         e = gpio_pullup_dis (g.num);
   }
   if (g.pulldown && !g.nopull)
   {
      if (!e)
         e = gpio_pulldown_en (g.num);
   } else
   {
      if (!e)
         e = gpio_pulldown_dis (g.num);
   }
#ifndef CONFIG_IDF_TARGET_ESP32C3
   if (rtc_gpio_is_valid_gpio (g.num))
   {
      if (!g.pulldown && !g.nopull)
      {
         if (!e)
            e = rtc_gpio_pullup_en (g.num);
      } else
      {
         if (!e)
            e = rtc_gpio_pullup_dis (g.num);
      }
      if (g.pulldown && !g.nopull)
      {
         if (!e)
            e = rtc_gpio_pulldown_en (g.num);
      } else
      {
         if (!e)
            e = rtc_gpio_pulldown_dis (g.num);
      }
   }
#endif
#endif
   return e;
}

uint8_t
revk_gpio_get (revk_gpio_t g)
{
   if (g.set && GPIO_IS_VALID_GPIO (g.num))
      return gpio_get_level (g.num) ^ g.invert;
   return 0;
}
#endif
